Repository: FedericoCeratto/debhelpers
Catalog: man/po4a/po/*.po
Languages: fr

source: B<dh_testdir> [S<I<debhelper options>>] [S<I<file ...>>]
fr: B<dh_testdir> [S<I<options de debhelper>>] [S<I<fichier ...>>]

source: dh_testdir tries to make sure that you are in the correct directory when building a debian package. It makes sure that the file debian/control exists, as well as any other files you specify. If not, it exits with an error.
fr: dh_testdir tente de s'assurer qu'il est exécuté depuis le bon répertoire pour construire un paquet. Il s'assure que le fichier /debian/control existe ainsi que tous les autres fichiers indiqués en paramètres de la ligne de commande. Dans le cas contraire il produit une erreur.

source: Test for the existence of these files too.
fr: Teste également l'existence de ces fichiers.

source: dh_testroot - ensure that a package is built as root
fr: dh_testroot - vérifie que le paquet est construit par le superutilisateur (root)

source: B<dh_testroot> [S<I<debhelper options>>]
fr: B<dh_testroot> [S<I<options de debhelper>>]

source: dh_testroot simply checks to see if you are root. If not, it exits with an error. Debian packages must be built as root, though you can use L<fakeroot(1)>
fr: dh_testroot se contente de contrôler si la construction du paquet est lancée par le superutilisateur. Si ce n'est pas le cas il retourne une erreur. Les paquets Debian doivent être construits par le superutilisateur, éventuellement en utilisant L<fakeroot(1)>

source: dh_testversion - ensure that the correct version of debhelper is installed
fr: dh_testversion - vérifie que la bonne version de debhelper est installée

source: B<dh_testversion> [S<I<debhelper options>>] [I<operator>] [I<version>]
fr: B<dh_testversion> [S<I<options de debhelper>>] [I<opérateur>] [I<version>]

source: Note: This program is deprecated. You should use build dependencies instead.
fr: S<Nota :> L'utilisation de ce programme est déconseillée. Il faut employer les dépendances de construction (build dependencies) à la place.

source: dh_testversion compares the version of debhelper against the version you specify, and if the condition is not met, exits with an error message.
fr: dh_testversion compare la version de debhelper avec la version spécifiée et, si la condition n'est pas satisfaite, génère un message d'erreur.

source: You can use this in your debian/rules files if a new debhelper feature is introduced, and your package requires that feature to build correctly. Use debhelper's changelog to figure out the version you need.
fr: Il est possible d'utiliser ce programme dans le fichier debian/rule si une nouvelle fonctionalité de debhelper est introduite et que le paquet nécessite cette fonctionalité pour être correctement construit. Consulter le changelog de debhelper pour déterminer la version nécessaire.

source: Be sure not to overuse dh_testversion. If debhelper version 9.5 introduces a new dh_autofixbugs command, and your package uses it, then if someone tries to build it with debhelper 1.0, the build will fail anyway when dh_autofixbugs cannot be found, so there is no need for you to use dh_testversion.
fr: Il faut prendre garde à ne pas abuser de dh_testversion. Si debhelper 9.5 introduit une nouvelle commande dh_autofixbugs et que le paquet l'utilise, alors si quelqu'un tente de construire le paquet avec debhelper 1.0, la construction échouera puisque dh_autofixbugs ne pourra pas être trouvé. De ce fait, il n'y a pas besoin d'utiliser dh_testversion.

source: I<operator>
fr: I<opérateur>

source: Optional comparison operator used in comparing the versions. If not specified, ">=" is used. For descriptions of the comparison operators, see dpkg --help.
fr: Opérateur optionnel de comparaison utilisé dans la comparaison des versions. S'il n'est pas indiqué, >= sera utilisé. Pour une description des opérateurs de comparaison, consulter dpkg --help.

source: Version number to compare against the current version of debhelper. If not specified, dh_testversion does nothing.
fr: Numéro de version à comparer avec la version courante de debhelper. S'il n'est pas spécifié, dh_testversion ne fait rien.

source: dh_undocumented - obsolete undocumented.7 symlink program
fr: dh_undocumented - programme obsolète de création de liens symboliques vers S<« undocumented.7 »>

source: This program used to make symlinks to the undocumented.7 man page for man pages not present in a package. Debian policy now frowns on use of the undocumented.7 man page, and so this program does nothing, and should not be used.
fr: Ce programme est utilisé pour créer des liens symboliques vers la page de manuel S<« undocumented.7 »> lorsque la page de manuel du paquet n'existe pas. La Charte Debian désapprouve l'utilisation de S<« undocumented.7 »>. De ce fait, ce programme ne fait rien et de doit pas être utilisé.

source: dh_usrlocal - migrate usr/local directories to maintainer scripts
fr: dh_usrlocal - migre les répertoires usr/local dans les scripts de maintenance du paquet

source: B<dh_usrlocal> [S<I<debhelper options>>] [B<-n>]
fr: B<dh_usrlocal> [S<I<options de debhelper>>] [B<-n>]

source: dh_usrlocal is a debhelper program that can be used for building packages that will provide a subdirectory in /usr/local when installed.
fr: dh_usrlocal est le programme de la suite debhelper qui peut être utilisé pour la construction des paquets qui produisent un sous-répertoire dans /usr/local lors de leur installation.

source: If the directories found in the build tree have unusual owners, groups, or permissions, then those values will be preserved in the directories made by the postinst script. However, as a special exception, if a directory is owned by root.root, it will be treated as if it is owned by root.staff and is mode 2775. This is useful, since that is the group and mode policy recommends for directories in /usr/local.
fr: Si les répertoires trouvés dans le répertoire de construction du paquet ont un propriétaire, un groupe ou des droits inhabituels, ces valeurs seront préservées dans les répertoires créés par le script de maintenance postinst. Une exception notable S<toutefois :> si le répertoire a comme propriété root.root, il sera traité comme root.staff avec des droits 2775. Cela est utile depuis que ce sont les valeurs recommandées par la Charte Debian pour les répertoires de /usr/local.

source: Do not modify F<postinst>/F<prerm> scripts.
fr: Empêche la modification des scripts de maintenance du paquet F<postinst> et F<prerm>.

source: Debian policy, version 2.2
fr: Charte Debian, version 2.2
