Repository: FedericoCeratto/debhelpers
Catalog: man/po4a/po/*.po
Languages: fr

source: It also automatically generates the postinst and postrm and prerm commands needed to set up the symlinks in /etc/rc*.d/ and to start and stop the init scripts.
fr: De plus, il produit automatiquement les lignes de code des scripts de maintenance postinst, postrm et prerm nécessaires à la configuration des liens symboliques dans /etc/rc*.d/ et gère le démarrage et l'arrêt des scripts d'initialisation.

source: If a file named debian/package.init exists, then it is installed into etc/init.d/package in the package build directory, with "package" replaced by the package name.
fr: S'il existe un fichier nommé debian/paquet.init, il sera installé dans le répertoire de construction du paquet sous etc/init.d/paquet où le mot S<« paquet »> sera remplacé par le nom du paquet.

source: If a file named debian/package.default exists, then it is installed into etc/default/package in the package build directory, with "package" replaced by the package name.
fr: S'il existe un fichier nommé debian/paquet.default, il sera installé dans le répertoire de construction du paquet sous etc/default/paquet où le mot S<« paquet »> sera remplacé par le nom du paquet.

source: Do not modify postinst/postrm/prerm scripts.
fr: Empêche la modification des scripts de maintenance postinst, postrm et prerm.

source: Only modify postinst/postrm/prerm scripts, do not actually install any init script or default files. May be useful if the init script is shipped and/or installed by upstream in a way that doesn't make it easy to let dh_installinit find it.
fr: Modifie seulement les scripts de postinst, postrm et prerm. N'installe actuellement ni script d'initialisation, ni fichier par défaut. Ceci peut être utile si le script d'initialisation est inclus et/ou installé en amont d'une façon qui ne rend pas facile sa recherche par dh_installinit.

source: Do not restart init script on upgrade.
fr: Empêche le redémarrage du script d'initialisation lors d'une mise à jour.

source: Do not start the init script on install or upgrade, or stop it on removal. Only call update-rc.d. Useful for rcS scripts.
fr: Empêche le lancement du script d'initialisation lors de l'installation ou de la mise à jour, ainsi que l'arrêt lors de la suppression. Lance uniquement un update-rc.d. Utile pour les scripts rcS.

source: Remove trailing "d" from the name of the package, and use the result for the filename the init script is installed as in etc/init.d/ , and the default file is installed as in etc/default/ . This may be useful for daemons with names ending in "d". (Note: this takes precedence over the --init-script parameter described below.)
fr: Enlève le S<« d »> situé à la fin du nom du paquet et utilise le résultat comme nom du fichier de script d'initialisation, installé dans etc/init.d/, et comme nom du fichier S<« default »> installé dans etc/default/. Ceci peut être utile pour des démons dont le nom est terminé par S<« d »>. Ce paramètre a priorité sur --init-script décrit ci-dessous.

source: B<-u>I<params> B<--update-rcd-params=>I<params>
fr: B<-u>I<paramètres> B<--update-rcd-params=>I<paramètres>

source: Pass "params" to L<update-rc.d(8)>. If not specified, "defaults" will be passed to L<update-rc.d(8)>.
fr: Passe les paramètres indiqués à L<update-rc.d(8)>. Si rien n'est indiqué, S<« defaults »> sera passé à L<update-rc.d(8)>.

source: Install the init script (and default file) using the filename I<name> instead of the default filename, which is the package name. When this parameter is used, dh_installinit looks for and installs files named debian/package.name.init and debian/package.name.default, instead of the usual debian/package.init and debian/package.default.
fr: Installe le script d'initialisation (et le fichier S<« default »>) en utilisant le I<nom> indiqué au lieu du nom du paquet. Quand ce paramètre est employé, dh_installinit recherche et installe des fichiers appelés debian/paquet.nom.init et debian/paquet.nom.default, au lieu des debian/paquet.init et debian/paquet.default habituels.

source: B<--init-script=>I<scriptname>
fr: B<--init-script=>I<nom-du-script>

source: Use "scriptname" as the filename the init script is installed as in etc/init.d/ (and also use it as the filename for the defaults file, if it is installed). If you use this parameter, dh_installinit will look to see if a file in the debian/ directory exists that looks like "package.scriptname" and if so will install it as the init script in preference to the files it normally installs.
fr: Utilise S<« nom-du-script »> en tant que nom du script d'initialisation dans etc/init.d/ et, si besoin est, comme nom du fichier S<« defaults »>. Avec ce paramètre dh_installinit cherche dans le répertoire debian/ un fichier du genre S<« paquet.nom-du-script »> et, s'il le trouve, l'installera en tant que script d'initialisation à la place des fichiers qu'il installe habituellement.

source: This parameter is deprecated, use the --name parameter instead.
fr: Ce paramètre est déconseillé. Il vaut mieux utiliser --name.

source: B<--error-handler=>I<function>
fr: B<--error-handler=>I<fonction>

source: Call the named shell function if running the init script fails. The function should be provided in the prerm and postinst scripts, before the #DEBHELPER# token.
fr: Invoque la fonction indiquée (via l'interpréteur de commande) dans le cas où le script d'initialisation échouerait. La fonction doit être décrite dans les scripts de maintenance prerm et postinst avant l'apparition de #DEBHELPER#.

source: dh_installlogcheck - install logcheck rulefiles into etc/logcheck/
fr: dh_installlogcheck - installe les fichiers de règles de vérification des journaux (logcheck rulefiles) dans etc/logcheck/

source: B<dh_installlogcheck> [S<B<debhelper options>>]
fr: B<dh_installlogcheck> [S<B<options de debhelper>>]

source: dh_installlogcheck is a debhelper program that is responsible for installing logcheck rule files into subdirectories of etc/logcheck/ in package build directories. The files debian/package.logcheck.cracking, debian/package.logcheck.violations, debian/package.logcheck.violations.ignore, debian/package.logcheck.ignore.workstation, debian/package.logcheck.ignore.server and debian/package.logcheck.ignore.paranoid are installed if present.
fr: dh_installlocgheck est le programme de la suite debhelper chargé de l'installation des fichiers de règles de vérification des journaux (logcheck rule files) dans le sous-répertoire etc/logcheck/ du répertoire de construction du paquet. S'ils existent, les fichiers suivants sont S<installés :> debian/package.logcheck.cracking debian/package.logcheck.violations debian/package.logcheck.violations.ignore debian/package.logcheck.ignore.workstation debian/package.logcheck.ignore.server debian/package.logcheck.ignore.paranoid.

source: This program is a part of debhelper.
fr: Ce programme fait partie de debhelper.

source: dh_installlogrotate - install logrotate config files
fr: dh_installlogrotate - installe les fichiers de configuration de la rotation des journaux (logrotate)

source: B<dh_installlogrotate> [S<I<debhelper options>>] [B<--name=>I<name>]
fr: B<dh_installlogrotate> [S<I<options de debhelper>>] [B<--name=>I<nom>]

source: dh_installlogrotate is a debhelper program that is responsible for installing logrotate config files into etc/logrotate.d in package build directories. Files named debian/package.logrotate are installed.
fr: dh_installlogrotate est le programme de la suite debhelper chargé de l'installation des fichiers nommés debian/paquet.logrotate, dans le répertoire de construction du paquet, sous etc/logrotate.d.

source: Look for files named debian/package.name.logrotate and install them as etc/logrotate.d/name, instead of using the usual files and installing them as the package name.
fr: Recherche des fichiers nommés debian/I<paquet>.I<nom>.logrotate et les installe sous etc/logrotate.d/I<nom> au lieu d'utiliser les fichiers habituels et de les installer en les baptisant du nom du paquet.

source: dh_installmanpages - old-style man page installer
fr: dh_installmanpages - ancien programme d'installation des pages de manuel

source: B<dh_installmanpages> [S<I<debhelper options>>] [S<I<file ...>>]
fr: B<dh_installmanpages> [S<I<options de debhelper>>] [S<I<fichier ...>>]

source: dh_installmanpages is a debhelper program that is responsible for automatically installing man pages into usr/share/man/ and usr/X11R6/man/ in package build directories.
fr: dh_installmanpages est l'ancien programme de la suite debhelper chargé de l'installation automatique des pages de manuel dans les répertoires usr/share/man/ et usr/X11R6/man/ du répertoire de construction du paquet.

source: This is a DWIM-style program, with an interface unlike the rest of debhelper. It is deprecated, and you are encouraged to use L<dh_installman(1)> instead.
fr: C'est un programme de style DWIM, possédant une interface différente du reste de la suite debhelper. Son usage est déconseillé et il faut lui préférer L<dh_installman(1)>.

source: dh_installmanpages scans the current directory and all subdirectories for filenames that look like man pages. (Note that only real files are looked at; symlinks are ignored.) It uses L<file(1)> to verify that the files are in the correct format. Then, based on the files' extensions, it installs them into the correct man directory.
fr: dh_installmanpages explore le répertoire actuel et tous les sous-répertoires à la recherche de fichiers portant un nom ressemblant à ceux utilisés pour les pages de manuel. S<Nota :> Seuls les vrais répertoires sont scrutés, les liens symboliques sont ignorés. dh_installmanpages utilise L<file(1) > pour vérifier si les fichiers sont dans un format correct, puis se base sur l'extension du fichier pour l'installer dans le bon répertoire.

source: All filenames specified as parameters will be skipped by dh_installmanpages. This is useful if by default it installs some man pages that you do not want to be installed.
fr: Tous les fichiers indiqués sur la ligne de commande seront ignorés par dh_installmanpages. C'est pratique si, par défaut, il installe des pages de manuel dont vous ne voulez pas.

source: After the man page installation step, dh_installmanpages will check to see if any of the man pages are ".so" links. If so, it changes them to symlinks.
fr: Après l'étape d'installation des pages de manuel, dh_installmanpages vérifie si des pages de manuel contiennent des liens S<« .so »>. Dans ce cas il les transforme en liens symboliques.

source: Do not install these files as man pages, even if they look like valid man pages.
fr: N'installe pas les fichiers indiqués même s'ils ressemblent à des pages de manuel.

source: BUGS
fr: BOGUES

source: dh_installmanpages will install the man pages it finds into B<all> packages you tell it to act on, since it can't tell what package the man pages belong in. This is almost never what you really want (use -p to work around this, or use the much better L<dh_installman(1)> program instead).
fr: dh_installmanpages installe les pages de manuel qu'il trouve dans B<tous> les paquets traités puisqu'on ne peut pas préciser à quel paquet les pages de manuel appartiennent. Ce n'est presque jamais ce qui est désiré. (On peut employer -p pour s'en sortir, mais il vaut mieux utiliser L<dh_installman(1)>.)

source: Files ending in I<.man> will be ignored.
fr: Les fichiers finissant par I<.man> sont ignorés.

source: Files specified as parameters that contain spaces in their filenames will not be processed properly.
fr: Les fichiers indiqués en paramètres sur la ligne de commande, qui contiennent des espaces dans leurs noms, ne seront pas traités correctement.

source: dh_installman - install man pages into package build directories
fr: dh_installman - installe les pages de manuel dans le répertoire de construction du paquet

source: B<dh_installman> [S<I<debhelper options>>] [S<I<manpage ...>>]
fr: B<dh_installman> [S<I<options de debhelper>>] [S<I<page-de-manuel ...>>]

source: dh_installman is a debhelper program that handles installing man pages into the correct locations in package build directories. You tell it what man pages go in your packages, and it figures out where to install them based on the section field in their .TH line. If you have a properly formatted .TH line, your man page will be installed into the right directory, with the right name (this includes proper handling of pages with a subsection, like "3perl", which are placed in man3, and given an extension of ".3perl"). If your .TH line is incorrect or missing, the program may guess wrong based on the file extension.
fr: dh_installman est le programme de la suite debhelper chargé de l'installation des pages de manuel à l'emplacement correct dans le répertoire de construction du paquet. À partir de la liste des pages de manuel à installer, dh_installman examine la section indiquée à la ligne .TH de la page et en déduit la destination. Si la ligne .TH est correctement renseignée, les pages de manuel seront installées dans la bonne section avec le nom adéquat. Ce mécanisme fonctionne également pour les pages comportant des sous-sections, telle que S<« 3perl »>, qui sera placé en S<« man3 »> et portera l'extension S<« .3perl »>. Si la ligne .TH est erronée ou absente, le programme peut faire une mauvaise déduction, basée sur l'extension du fichier.

source: It also supports translated man pages, by looking for extensions like .ll.8 and .ll_LL.8, or by use of the --language switch.
fr: dh_installman gère également les traductions de pages de manuel soit en cherchant des extensions telles que .ll.8 et ll_LL.8, soit en utilisant l'option S<« --language »>. (S<NdT :> S<« ll »> représente le code langue sur deux caractères et S<« LL »> la variante locale sur deux caractères également. Par S<exemple :> fr_BE pour le français de Belgique.)

source: Any man page filenames specified as parameters will be installed into the first package dh_installman is told to act on. By default, this is the first binary package in debian/control, but if you use -p, -i, or -a flags, it will be the first package specified by those flags.
fr: Toutes les pages de manuel indiquées en paramètres de la ligne de commande seront installées dans le premier paquet traité par dh_installman. Par défaut, il s'agit du premier paquet indiqué dans le fichier debian/control, mais, si les options -p, -i ou -a sont utilisées, il s'agira du premier paquet indiqué par ces options.

source: Files named debian/package.manpages can list other man pages to be installed.
fr: Des fichiers nommés debian/paquet.manpages peuvent indiquer d'autres pages de manuel à installer.

source: After the man page installation step, dh_installman will check to see if any of the man pages in the temporary directories of any of the packages it is acting on contain ".so" links. If so, it changes them to symlinks.
fr: Après l'étape d'installation des pages de manuel, dh_installman vérifie si des pages de manuel, contenues dans les répertoire temporaires des paquets traités, contiennent des liens S<« .so »>. Dans ce cas il les transforme en liens symboliques.

source: Use this to specify that the man pages being acted on are written in the specified language.
fr: Permet de spécifier que les pages de manuel doivent être traitées comme étant écrites dans le langage indiqué par S<« ll »>.

source: I<manpage ...>
fr: I<page-de-manuel ...>

source: Install these man pages into the first package acted on. (Or in all packages if -A is specified).
fr: Installe les pages de manuel indiquées dans le premier paquet traité (ou dans tous les paquets traités si -A est indiqué).

source: An older version of this program, L<dh_installmanpages(1)>, is still used by some packages, and so is still included in debhelper. It is, however, deprecated, due to its counterintuitive and inconsistent interface. Use this program instead.
fr: Une ancienne version de ce programme, L<dh_installmanpages(1)>, est encore employée dans quelques paquets. Pour cette raison, l'ancienne version est encore incluse dans debhelper. Il est cependant déconseillé de l'employer en raison de son interface non intuitive et contradictoire. Il faut employer ce programme à la place.

source: dh_installmenu - install debian menu files into package build directories
fr: dh_installmenu - installe les fichiers du menu Debian dans le répertoire de construction du paquet

source: B<dh_installmenu> [S<B<debhelper options>>] [B<-n>]
fr: B<dh_installmenu> [S<B<options de debhelper>>] [B<-n>]

source: dh_installmenu is a debhelper program that is responsible for installing files used by the debian menu package into package build directories.
fr: dh_installmenu est le programme de la suite debhelper chargé de l'installation, dans le répertoire de construction du paquet, des fichiers utilisés par le paquet S<« menu »> de Debian.

source: If a file named debian/package.menu exists, then it is installed into usr/share/menu/package in the package build directory. This is a debian menu file. See L<menufile(5)> for its format.
fr: S'il existe un fichier nommé debian/paquet.menu, il est installé, dans le répertoire de construction du paquet, sous usr/share/menu/paquet, en tant que fichier de menu Debian. Consulter L<menufile(5)> pour la description du format de ce fichier.

source: If a file named debian/package.menu-method exits, then it is installed into etc/menu-methods/package in the package build directory. This is a debian menu method file.
fr: S'il existe un fichier nommé debian/paquet.menu-method, il est installé, dans le répertoire de construction du paquet, sous etc/menu-methods/paquet, en tant que fichier de méthode de menu Debian.

source: Do not modify postinst/postrm scripts.
fr: Empêche la modification des scripts de maintenance postinst et postrm.

source: dh_installmime - install mime files into package build directories
fr: dh_installmime - installe les fichiers S<« mime »> dans le répertoire de construction du paquet

source: B<dh_installmime> [S<I<debhelper options>>] [B<-n>]
fr: B<dh_installmime> [S<I<options de debhelper>>] [B<-n>]

source: dh_installmime is a debhelper program that is responsible for installing mime files into package build directories.
fr: dh_installmime est le programme de la suite debhelper chargé de l'installation des fichiers S<« mime »> dans le répertoire de construction du paquet.

source: If files named debian/package.mime or debian/package.sharedmimeinfo exist, then they are installed into usr/lib/mime/packages/package and /usr/share/mime/packages/package.xml (respectively) in the package build directory.
fr: S'il existe des fichiers nommés debian/paquet.mime ou debian/paquet.sharedmimeinfo, ils sont installés dans le répertoire de construction du paquet, respectivement sous usr/lib/mime/packages/paquet et /usr/share/mime/packages/paquet.xml.

source: dh_installmodules - register modules with modutils
fr: dh_installmodules - inscrit les modules avec modutils

source: B<dh_installmodules> [S<I<debhelper options>>] [B<-n>] [B<--name=>I<name>]
fr: B<dh_installmodules> [S<I<options de debhelper>>] [B<-n>] [B<--name=>I<nom>]

source: dh_installmodules is a debhelper program that is responsible for registering kernel modules.
fr: dh_installmodules est le programme de la suite debhelper chargé de l'inscription des modules du noyau.

source: When this parameter is used, dh_installmodules looks for and installs files named debian/package.name.modules and debian/package.name.modprobe instead of the usual debian/package.modules and debian/package.modprobe
fr: Quand ce paramètre est utilisé, dh_installmodules cherche et installe les fichiers nommés debian/paquet.nom.modules et debian/paquet.nom.modprobe au lieu des fichiers habituels debian/paquet.modules et debian/paquet.modprobe.

source: dh_installpam - install pam support files
fr: dh_installpam - installe les fichiers de support de PAM

source: B<dh_installpam> [S<I<debhelper options>>] [B<--name=>I<name>]
fr: B<dh_installpam> [S<I<options de debhelper>>] [B<--name=>I<nom>]

source: dh_installpam is a debhelper program that is responsible for installing files used by PAM into package build directories.
fr: dh_installpam est le programme de la suite debhelper chargé de l'installation, dans le répertoire de construction du paquet, des fichiers utilisés par PAM.

source: If a file named debian/package.pam exists, then it is installed into etc/pam.d/package in the package build directory.
fr: S'il existe un fichier nommé debian/paquet.pam, il est installé, dans le répertoire de construction du paquet, sous etc/pam.d/paquet.

source: Look for files named debian/package.name.pam and install them as etc/pam.d/name, instead of using the usual files and installing them as the package name.
fr: Recherche les fichiers nommés debian/paquet.nom.pam et les installe sous etc/pam.d/nom au lieu d'utiliser les fichiers habituels et de les installer sous le nom du paquet.

source: dh_install - install files into package build directories
fr: dh_install - installe les fichiers dans le répertoire de construction du paquet

source: B<dh_install> [B<-X>I<item>] [B<--autodest>] [B<--sourcedir=>I<dir>] [S<I<debhelper options>>] [S<I<file [...] dest>>]
fr: B<dh_install> [B<-X>I<élément>] [B<--autodest>] [B<--sourcedir=>I<répertoire>] [S<I<options de debhelper>>] [S<I<fichier [...] destination>>]

source: dh_install is a debhelper program that handles installing files into package build directories. There are many dh_install* commands that handle installing specific types of files such as documentation, examples, man pages, and so on, and they should be used when possible as they often have extra intelligence for those particular tasks. dh_install, then, is useful for installing everything else, for which no particular intelligence is needed. It is a replacement for the old dh_movefiles command.
fr: dh_install est un programme de la suite debhelper chargé de l'installation des fichiers dans les répertoires de construction des paquets. Il existe plein de commandes dh_install* qui gèrent l'installation de types de fichiers particuliers tels que les documentations, les exemples, les pages de manuel, et ainsi de suite. Ces commandes spécifiques doivent être employées autant que possible car elles présentent souvent un savoir-faire supplémentaire pour ces tâches particulières. dh_install, en revanche, est utile pour installer tout le reste, c'est-à-dire tous les fichiers pour lesquels aucun savoir-faire particulier n'est nécessaire. Ce programme vient en remplacement de l'ancien programme dh_movefiles.

source: Files named debian/package.install list the files to install into each package and the directory they should be installed to. The format is a set of lines, where each line lists a file or files to install, and at the end of the line tells the directory it should be installed in. The name of the files (or directories) to install should be given relative to the current directory, while the installation directory is given relative to the package build directory. You may use wildcards in the names of the files to install (in v3 mode and above).
fr: Les fichiers nommés debian/paquet.install énumèrent les fichiers à installer pour le paquet considéré ainsi que le répertoire où ils doivent être installés. Ce fichier est formé d'une suite de lignes. Chaque ligne indique un ou plusieurs fichiers à installer et se termine par le répertoire où doit être faite l'installation. Le nom des fichiers (ou des répertoires) à installer doit être fourni avec un chemin relatif au répertoire courant, alors que le répertoire de destination est indiqué relativement au répertoire de construction du paquet. Il est possible d'employer des jokers (wildcard) dans les noms des fichiers à installer (à partir de la version 3).
