Repository: FedericoCeratto/debhelpers
Catalog: man/po4a/po/*.po
Languages: fr

source: dh_md5sums is a debhelper program that is responsible for generating a DEBIAN/md5sums file, which lists the md5sums of each file in the package. These files are used by the debsums package.
fr: dh_md5sums est le programme de la suite debhelper chargé de produire un fichierDEBIAN/md5sums indiquant la somme md5 de chacun des fichiers du paquet. Ces fichiers sont habituellement exploités par le paquet debsums.

source: All files in DEBIAN/ are omitted from the md5sums file, as are all conffiles (unless you use the --include-conffiles switch).
fr: Tous les fichiers du répertoire DEBIAN/ sont exclus du fichier md5sums, de même que tous les fichiers de configuration (conffiles) sauf si --include-conffiles est employé.

source: The md5sums file is installed with proper permissions and ownerships.
fr: Le fichier md5sums est installé avec les droits et permissions adéquats.

source: Include conffiles in the md5sums list. Note that this information is redundant since it is included elsewhere in debian packages.
fr: Inclut les fichiers de configuration (conffiles) dans la liste des sommes md5. S<Nota :> Cette information est superflue puisqu'elle est incluse par ailleurs dans les paquets Debian.

source: Exclude files that contain "item" anywhere in their filename from being listed in the md5sums file.
fr: Exclut les fichiers qui comportent S<« élément »>, n'importe où dans leur nom, de la liste des sommes md5.

source: dh_movefiles - move files out of debian/tmp into subpackages
fr: dh_movefiles - déplace des fichiers depuis debian/tmp dans des sous-paquets

source: B<dh_movefiles> [S<I<debhelper options>>] [B<--sourcedir=>I<dir>] [B<-X>I<item>] S<I<file ...>>]
fr: B<dh_movefiles> [S<I<options de debhelper>>] [B<--sourcedir=>I<répertoire>] [B<-X>I<élément>] [S<I<fichier ...>>]

source: dh_movefiles is a debhelper program that is responsible for moving files out of debian/tmp or some other directory and into other package build directories. This may be useful if your package has a Makefile that installs everything into debian/tmp, and you need to break that up into subpackages.
fr: dh_movefiles est le programme de la suite debhelper chargé du déplacement des fichiers depuis debian/tmp ou depuis un autre répertoire vers un autre répertoire de construction du paquet. Cela peut être utile si le paquet a un Makefile qui implante tout dans debian/tmp, et qu'il est nécessaire d'éclater cela dans plusieurs sous-paquets.

source: Files named debian/package.files list the files to be moved, separated by whitespace. The filenames listed should be relative to debian/tmp/. You can also list directory names, and the whole directory will be moved. If you prefer, you can list the files to move on the command line and this will apply to the first package dh_movefiles is told to act on.
fr: Le fichier nommé debian/paquet.files énumère les fichiers qui seront déplacés en les séparant par un blanc (whitespace). Les noms des fichiers doivent être relatifs à debian/tmp/. On peut aussi indiquer un nom de répertoire. Dans ce cas le répertoire complet sera déplacé. Il est également possible d'énumérer les fichiers à déplacer en ligne de commande. Cela s'appliquera alors au premier paquet que dh_movefiles traitera.

source: B<--sourcedir=>I<dir>
fr: B<--sourcedir=>I<répertoire>

source: Instead of moving files out of debian/tmp (the default), this option makes it move files out of some other directory. Since the entire contents of the sourcedir is moved, specifying something like --sourcedir=/ is very unsafe, so to prevent mistakes, the sourcedir must be a relative filename; it cannot begin with a `/'.
fr: Au lieu de déplacer les fichiers depuis debian/tmp (comportement par défaut), cette option permet les déplacements à partir d'un autre répertoire. Puisque le contenu entier du répertoire source est déplacé, le fait d'indiquer quelque chose comme --sourcedir=/ serait très dangereux. Aussi, pour empêcher ces erreurs, le répertoire source doit être un nom de fichier relatif. Il ne peut donc pas commencer par S<« / »>.

source: Lists files to move. The filenames listed should be relative to debian/tmp/. You can also list directory names, and the whole directory will be moved. It is an error to list files here unless you use -p, -i, or -a to tell dh_movefiles which subpackage to put them in.
fr: Énumère les fichiers à déplacer. Les noms de fichiers indiqués doivent être relatifs à debian/tmp/. Il est également possible d'indiquer un nom de répertoire. Dans ce cas, le répertoire complet sera déplacé. C'est une erreur d'indiquer ici des noms de fichiers sauf avec les options -p, -i ou -a pour indiquer à dh_movefiles dans quel sous-paquet les mettre.

source: Note that files are always moved out of debian/tmp by default (even if you have instructed debhelper to use a compatibility level higher than one, which does not otherwise use debian/tmp for anything at all). The idea behind this is that the package that is being built can be told to install into debian/tmp, and then files can be moved by dh_movefiles from that directory. Any files or directories that remain are ignored, and get deleted by dh_clean later.
fr: S<Nota :> Les fichiers sont, par défaut, toujours déplacés depuis debian/tmp (même s'il a été demandé à debhelper d'utiliser un niveau de compatibilité supérieur à 1, ce qui induit que debian/tmp n'est utilisé pour rien d'autre). L'idée sous-jacente est que le paquet en construction peut s'installer dans debian/tmp, et qu'alors les fichiers peuvent être déplacés par dh_movefiles à partir de là. Tous les fichiers ou répertoires qui resteront seront ignorés et supprimés ultérieurement par dh_clean.

source: B<dh_perl> [S<I<debhelper options>>] [B<-d>] [S<I<library dirs ...>>]
fr: B<dh_perl> [S<I<options de debhelper>>] [B<-d>] [S<I<bibliothèque répertoires ...>>]

source: dh_perl is a debhelper program that is responsible for generating the ${perl:Depends} substitutions and adding them to substvars files.
fr: dh_perl est le programme de la suite debhelper chargé de produire les substitutions ${perl:Depends} et de les ajouter aux fichiers des variables de substitution (substvars files).

source: The program will look at perl scripts and modules in your package, and will use this information to generate a dependency on perl or perlapi. The dependency will be substituted into your package's control file wherever you place the token "${perl:Depends}".
fr: Le programme examine les scripts et les modules Perl du paquet, et exploite cette information pour produire une dépendance vers perl ou perlapi. La substitution a lieu dans le fichier S<« control »> du paquet, à l'emplacement où est indiqué S<« ${perl:Depends} »>.

source: In some specific cases you may want to depend on perl-base rather than the full perl package. If so, you can pass the -d option to make dh_perl generate a dependency on the correct base package. This is only necessary for some packages that are included in the base system.
fr: Dans quelques cas spécifiques, il peut être souhaitable de créer la dépendance envers perl-base plutôt qu'envers le paquet perl complet. Dans ce cas, l'option -d entraîne dh_perl à produire une dépendance sur le bon paquet de base. Ceci n'est nécessaire que pour quelques paquets inclus dans le système de base.

source: Note that this flag may cause no dependency on perl-base to be generated at all. perl-base is Essential, so its dependency can be left out, unless a versioned dependency is needed.
fr: S<Nota :> Cette option peut ne produire aucune dépendance sur perl-base. Du fait que perl-base fait partie des paquets S<« Essential »>, sa dépendance peut être omise, à moins qu'une dépendance de version soit nécessaire.

source: By default, scripts and architecture independent modules don't depend on any specific version of perl. The -V option causes the current version of the perl (or perl-base with -d) package to be specified.
fr: Par défaut, les scripts et les modules indépendants de l'architecture ne dépendent pas d'une version spécifique de Perl. L'option -V permet de spécifier la version en cours du paquet perl (ou perl-base avec -d).

source: I<library dirs>
fr: I<bibliothèque répertoires>

source: If your package installs perl modules in non-standard directories, you can make dh_perl check those directories by passing their names on the command line. It will only check the vendorlib and vendorarch directories by default.
fr: Si le paquet installe les modules Perl dans un répertoire non standard, il est possible de forcer dh_perl à vérifier ces répertoires en passant leur nom en argument de la ligne de commande. Par défaut il vérifiera seulement les répertoires vendorlib et vendorarch.

source: Debian policy, version 3.0.1
fr: Charte Debian, version 3.0.1

source: Perl policy, version 1.18
fr: Charte Perl, version 1.18

source: dh_python - calculates python dependencies and adds postinst and prerm python scripts
fr: dh_python - détermine les dépendances Python et ajoute des scripts de maintenance Python postinst et prerm

source: B<dh_python> [S<I<debhelper options>>] [B<-n>] [B<-V> I<version>] [S<I<module dirs ...>>]
fr: B<dh_python> [S<I<options de debhelper>>] [B<-n>] [B<-V> I<version>] [S<I<module répertoires ...>>]

source: Note: This program is deprecated. You should use dh_pysupport or dh_pycentral instead. This program will do nothing if debian/pycompat or a Python-Version control file field exists.
fr: Notez bien que ce programme est obsolète. Il faut utiliser S<« dh_pysupport »> ou S<« dh_pycentral »> à la place. Ce programme ne fera rien si le champ S<« debian/pycompat »> ou S<« Python-Version »> existe dans le fichier S<« control »>.

source: dh_python is a debhelper program that is responsible for generating the ${python:Depends} substitutions and adding them to substvars files. It will also add a postinst and a prerm script if required.
fr: dh_python est le programme de la suite debhelper chargé de produire les substitutions ${python:Depends} et de les ajouter aux fichiers des variables de substitution (substvars files). Il ajoutera également, si nécessaire, les scripts de maintenance postinst et prerm.

source: The program will look at python scripts and modules in your package, and will use this information to generate a dependency on python, with the current major version, or on pythonX.Y if your scripts or modules need a specific python version. The dependency will be substituted into your package's control file wherever you place the token "${python:Depends}".
fr: Le programme examinera les scripts et les modules Python du paquet et exploitera cette information pour produire une dépendance envers la version majeure courante de Python ou envers pythonX.Y si les scripts ou les modules nécessitent une version particulière. La substitution aura lieu dans le fichier S<« control »> du paquet, à l'emplacement où est indiqué S<« ${python:Depends} »>.

source: If some modules need to be byte-compiled at install time, appropriate postinst and prerm scripts will be generated. If already byte-compiled modules are found, they are removed.
fr: Si certains modules doivent être compilés (byte-compiled) lors de l'installation, les scripts adéquats de maintenance du paquet, postinst et prerm, seront produits. Si des modules déjà compilés sont trouvés, ils sont supprimés.

source: If you use this program, your package should build-depend on python.
fr: Si ce programme est utilisé, le paquet devrait dépendre de Python pour sa construction (build-depend).

source: I<module dirs>
fr: I<module répertoires>

source: If your package installs python modules in non-standard directories, you can make dh_python check those directories by passing their names on the command line. By default, it will check /usr/lib/site-python, /usr/lib/$PACKAGE, /usr/share/$PACKAGE, /usr/lib/games/$PACKAGE, /usr/share/games/$PACKAGE and /usr/lib/python?.?/site-packages.
fr: Si le paquet installe les modules Python dans un répertoire non standard, il est possible de forcer dh_python à vérifier ces répertoires en passant leur nom en argument de la ligne de commande. Par défaut il vérifiera /usr/lib/site-python, /usr/lib/$PACKAGE, /usr/share/$PACKAGE, /usr/lib/games/$PACKAGE, /usr/share/games/$PACKAGE et /usr/lib/python?.?/site-packages.

source: Note: only /usr/lib/site-python, /usr/lib/python?.?/site-packages and the extra names on the command line are searched for binary (.so) modules.
fr: S<Nota :> les modules binaires (.so) ne seront cherchés que dans /usr/lib/site-python, /usr/lib/python?.?/site-packages et dans les répertoires passés en argument sur la ligne de commande.

source: If the .py files your package ships are meant to be used by a specific pythonX.Y version, you can use this option to specify the desired version, such as 2.3. Do not use if you ship modules in /usr/lib/site-python.
fr: Si le fichier .py indique que le paquet est censé être exploité par une version spécifique pythonX.Y, il est possible d'employer cette option pour indiquer la version désirée, telle que 2.3. Ne pas utiliser cette option si les modules sont placés dans /usr/lib/site-python.

source: Debian policy, version 3.5.7
fr: Charte Debian, version 3.5.7

source: Python policy, version 0.3.7
fr: Charte Python, version 0.3.7

source: most ideas stolen from Brendan O'Dea <bod@debian.org>
fr: La plupart des idées ont été volées à Brendan O'Dea <bod@debian.org>

source: dh_scrollkeeper - generate ScrollKeeper registration scripts
fr: dh_scrollkeeper - produit les scripts d'enregistrement ScrollKeeper

source: B<dh_scrollkeeper> [S<I<debhelper options>>] [B<-n>] [S<I<directory>>]
fr: B<dh_scrollkeeper> [S<I<options de debhelper>>] [B<-n>] [S<I<répertoire>>]

source: B<dh_scrollkeeper> is a debhelper program that handles correctly registering OMF files that it finds in package build trees with ScrollKeeper.
fr: B<dh_scrollkeeper> est le programme de la suite debhelper chargé de la maintenance, par ScrollKeeper, des inscriptions des fichiers OMF qu'il trouve dans le répertoire de construction du paquet.

source: It will also change any DTD declarations in the OMF and DocBook files to refer to local files instead of remote URLs. This change does not modify the source files, but the files in the package build tree.
fr: Ce programme changera également toutes les déclarations de DTD dans les fichiers OMF et DocBook pour se référer aux fichiers locaux au lieu des URL distantes. Ce changement ne modifie pas les fichiers source mais les fichiers du répertoire de construction du paquet.

source: Do not modify F<postinst>/F<postrm> scripts.
fr: Empêche la modification des scripts de maintenance F<postinst> et F<postrm>.

source: dh_shlibdeps - calculate shared library dependencies
fr: dh_shlibdeps - détermine les dépendances envers les bibliothèques partagées

source: B<dh_shlibdeps> [S<I<debhelper options>>] [B<-L>I<package>] [B<-l>I<directory>] [B<-X>I<item>] [S<B<--> I<params>>]
fr: B<dh_shlibdeps> [S<I<options de debhelper>>] [B<-L>I<paquet>] [B<-l>I<répertoire>] [B<-X>I<élément>] [S<B<--> I<paramètres>>]

source: dh_shlibdeps is a debhelper program that is responsible for calculating shared library dependencies for packages.
fr: dh_shlibdeps est le programme de la suite debhelper chargé de déterminer les dépendances des paquets envers les bibliothèques partagées.

source: This program is merely a wrapper around L<dpkg-shlibdeps(1)> that calls it once for each package listed in the control file, passing it a list of ELF executables and shared libraries it has found.
fr: Ce programme est simplement une encapsulation de L<dpkg-shlibdeps(1)> qu'il invoque une fois pour chaque paquet énuméré dans le fichier S<« control »> en lui passant une liste des exécutables ELF et des bibliothèques partagées qu'il a trouvés.

source: Pass "params" to L<dpkg-shlibdeps(1)>.
fr: Passe S<« paramètres »> à L<dpkg-shlibdeps(1)>.

source: Exclude files that contain "item" anywhere in their filename from being passed to dpkg-shlibdeps. This will make their dependencies be ignored. This may be useful in some situations, but use it with caution. This option may be used more than once to exclude more than one thing.
fr: Exclut de l'appel à dpkg-shlibdeps les fichiers qui comportent S<« élément »> n'importe où dans leur nom. De ce fait leurs dépendances seront ignorées. Cela peut-être utile dans quelques cas mais est à utiliser avec précaution. Cette option peut être utilisée plusieurs fois afin d'exclure plusieurs éléments.

source: B<-l>I<directory>[:directory:directory:..]
fr: B<-l>I<répertoire>[:répertoire:répertoire:..]

source: B<-L>I<package>, B<--libpackage=>I<package>
fr: B<-L>I<paquet>, B<--libpackage=>I<paquet>

source: Suppose that your source package produces libfoo1, libfoo-dev, and libfoo-bin binary packages. libfoo-bin links against libfoo1, and should depend on it. In your rules file, first run dh_makeshlibs, then dh_shlibdeps:
fr: Supposons que le paquet source produise les paquets binaires libtoto1, libtoto-dev et libtoto-bin. libtoto-bin utilise la bibliothèque libtoto1 et doit donc en dépendre. Dans le fichier rules il faut d'abord exécuter dh_makeshlibs puis S<dh_shlibdeps :>

source: This will have the effect of generating automatically a shlibs file for libfoo1, and using that file and the libfoo1 library in the debian/libfoo1/usr/lib directory to calculate shared library dependency information.
fr: Ceci aura pour effet de produire automatiquement un fichier shlibs pour libtoto1 et de l'utiliser, ainsi que la bibliothèque libtoto1, dans le répertoire debian/libtoto1/usr/lib pour déterminer les dépendances envers la bibliothèque partagée.

source: dh_strip - strip executables, shared libraries, and some static libraries
fr: dh_strip - dépouille les exécutables, les bibliothèques partagées, et certaines bibliothèques statiques

source: B<dh_strip> [S<I<debhelper options>>] [B<-X>I<item>] [--dbg-package=package] [--keep-debug]
fr: B<dh_strip> [S<I<options de debhelper>>] [B<-X>I<élément>] [--dbg-package=paquet] [--keep-debug]

source: dh_strip is a debhelper program that is responsible for stripping executables, shared libraries, and static libraries that are not used for debugging.
fr: dh_strip est le programme de la suite debhelper chargé de dépouiller les exécutables, les bibliothèques partagées et les bibliothèques statiques qui ne sont pas utilisés pour la mise au point.

source: This program examines your package build directories and works out what to strip on its own. It uses L<file(1)> and file permissions and filenames to figure out what files are shared libraries (*.so), executable binaries, and static (lib*.a) and debugging libraries (lib*_g.a, debug/*.so), and strips each as much as is possible. (Which is not at all for debugging libraries.) In general it seems to make very good guesses, and will do the right thing in almost all cases.
fr: Ce programme examine les répertoires de construction du paquet et détermine ce qui peut être dépouillé. Il s'appuie sur L<file(1)>, sur les permissions ainsi que sur les noms des fichiers pour deviner quels fichiers sont des bibliothèques partagées (*.so), des binaires exécutables, des bibliothèques statiques (lib*.a) ou des bibliothèques de mise au point (lib*_g.a, debug/*.so). Il dépouille chacun de ces éléments autant qu'il est possible (pas du tout pour des bibliothèques de mise au point). Il semble, généralement, faire de très bonnes conjectures et produit un résultat correct dans presque tous les cas.

source: Since it is very hard to automatically guess if a file is a module, and hard to determine how to strip a module, dh_strip does not currently deal with stripping binary modules such as .o files.
fr: Comme il est très difficile de deviner automatiquement si un fichier est un module, et difficile de déterminer comment dépouiller un module, dh_strip ne dépouille actuellement pas les modules binaires tels que des fichiers S<« .o »>.

source: Exclude files that contain "item" anywhere in their filename from being stripped. You may use this option multiple times to build up a list of things to exclude.
fr: Exclut du traitement les fichiers qui comportent S<« élément »> n'importe où dans leur nom. Il est possible d'utiliser cette option à plusieurs reprises pour établir une liste des éléments à exclure.

source: B<--dbg-package=>I<package>
fr: B<--dbg-package=>I<paquet>

source: Causes dh_strip to save debug symbols stripped from the packages it acts on as independent files in the package build directory of the specified debugging package.
fr: Cette option produit l'enregistrement, en tant que fichiers indépendants, des symboles dont ont été dépouillés les paquets traités. Ces fichiers sont enregistrés dans le répertoire de construction du paquet de mise au point indiqué.

source: Note that this option behaves significantly different in debhelper compatibility levels 4 and below. Instead of specifying the name of a debug package to put symbols in, it specifies a package (or packages) which should have separated debug symbols, and the separated symbols are placed in packages with "-dbg" added to their name.
fr: S<Nota :> cette option se comporte de façon sensiblement différente dans les niveaux de compatibilité 4 et inférieurs de debhelper. Au lieu d'indiquer le nom d'un paquet de mise au point où placer les symboles (cas de la v5), l'option indique (cas de la v4 et inférieure) le ou les paquets d'où proviennent les symboles de mise au point. Les symboles sont alors placés dans des paquets, suffixés par S<« -dbg »>.

source: Debug symbols will be retained, but split into an independent file in usr/lib/debug/ in the package build directory. --dbg-package is easier to use than this option, but this option is more flexible.
fr: Les symboles de mise au point seront conservés, mais séparés dans un fichier indépendant de usr/lib/debug/ dans le répertoire de construction du paquet. Il est plus facile d'employer dbg-package que cette option, mais cette dernière est plus souple.

source: dh_suidregister - obsolete suid registration program
fr: dh_suidregister - programme obsolète d'inscription suid

source: Do not run!
fr: Ne pas S<l'utiliser !>

source: This program used to register suid and sgid files with L<suidregister(1)>, but with the introduction of L<dpkg-statoverride(8)>, registration of files in this way is unnecessary, and even harmful, so this program should not be used.
fr: Ce programme était utilisé pour l'inscription des fichiers suid et sgid avec L<suidregister(1)> mais l'introduction de L<dpkg-statoverride(8)> a rendu l'inscription de ces fichiers inutile et même néfaste. De ce fait, ce programme ne doit pas être employé.

source: CONVERTING TO STATOVERRIDE
fr: CONVERSION EN STATOVERRIDE

source: Converting a package that uses this program to use the new statoverride mechanism is easy. Just remove the call to dh_suidregister from debian/rules, and add a versioned conflicts into your control file, as follows:
fr: Il est facile de convertir un paquet, qui utilise dh_suidregister, au nouveau mécanisme de statoverride. Il suffit de supprimer l'appel à dh_suidregister dans debian/rules et d'ajouter une gestion des conflits de versions dans le fichier S<« control »> de la façon S<suivante :>

source: The conflicts is only necessary if your package used to register things with suidmanager; if it did not, you can just remove the call to this program from your rules file.
fr: Cette indication de conflits n'est nécessaire que si le paquet inscrivait des éléments avec suidmanager. En dehors de ce cas, il suffit d'enlever l'appel à dh_suidregister du fichier S<« rules »>.

source: dh_testdir - test directory before building debian package
fr: dh_testdir - vérifie le répertoire avant de construire un paquet Debian
