Repository: FedericoCeratto/debhelpers
Catalog: man/po4a/po/*.po
Languages: fr

source: dh_strip --dbg-package now specifies the name of a package to put debugging symbols in, not the packages to take the symbols from.
fr: dh_strip --dbg-package indique maintenant le nom du paquet qui doit recevoir les symboles de mise au point et non plus les paquets d'où proviennent ces symboles.

source: dh_installdocs skips installing empty files.
fr: dh_installdocs saute l'installation des fichiers vides.

source: dh_install errors out if wildcards expand to nothing.
fr: dh_install génère des erreurs si les jokers (wildcards) ne correspondent à rien.

source: Doc directory symlinks
fr: Liens symboliques vers le répertoire de documentation

source: Sometimes it is useful to make a package not contain a /usr/share/doc/package directory at all, instead placing just a dangling symlink in the binary package, that points to some other doc directory. Policy says this is ok if your package depends on the package whose doc directory it uses. To accomplish this, just don't tell debhelper to install any documentation files into the package, and use dh_link to set up the symlink (or do it by hand), and debhelper should do the right thing: notice it is a dangling symlink and not try to install a copyright file or changelog.
fr: Parfois il est utile de construire un paquet qui ne contient pas de répertoire /usr/share/doc/paquet. On peut, à la place, créer un lien symbolique S<« en l'air »> qui pointe sur un autre répertoire de documentation. La Charte Debian indique que c'est autorisé si le paquet construit dépend du paquet comportant la documentation. Pour obtenir ce résultat, il suffit d'omettre l'installation du répertoire de documentation dans le paquet et d'employer dh_link pour générer le lien symbolique (ou le faire manuellement). Dans ce cas debhelper devrait se comporter correctement, c'est-à-dire remarquer qu'il s'agit d'un lien symbolique S<« en l'air »> et ne pas essayer d'installer un fichier copyright ou changelog.

source: Debhelper includes support for udebs. To create a udeb with debhelper, add "XC-Package-Type: udeb" to the package's stanza in debian/control, and build-depend on debhelper (>= 4.2). Debhelper will try to create udebs that comply with debian-installer policy, by making the generated package files end in ".udeb", not installing any documentation into a udeb, skipping over preinst, postrm, prerm, and config scripts, etc.
fr: Debhelper prend en charge la construction des udebs. Pour créer un udeb avec debhelper, il faut ajouter S<« XC>-Package-S<Type: udeb »> aux lignes de paquet dans debian/control, ainsi qu'une dépendance vers S<debhelper (>>S<= 4.2)> dans la ligne build-depend. Debhelper essayera de construire des udebs, conformément aux règles de l'installateur Debian, en suffixant les fichiers de paquets générés avec S<« .udeb »>, en n'installant aucune documentation, en omettant les scripts preinst, postrm et prerm ainsi que les scripts de configuration, etc.

source: Other notes
fr: Autres remarques

source: In general, if any debhelper program needs a directory to exist under debian/, it will create it. I haven't bothered to document this in all the man pages, but for example, dh_installdeb knows to make debian/<package>/DEBIAN/ before trying to put files there, dh_installmenu knows you need a debian/<package>/usr/share/menu/ before installing the menu files, etc.
fr: Généralement, si un programme de debhelper a besoin qu'un répertoire existe dans debian/, il le créera. Ce comportement n'est pas documenté dans toutes les pages de manuel, mais, par exemple, le dh_installdeb sait qu'il doit créer le répertoire debian/I<paquet>/DEBIAN/ avant de tenter de mettre des fichiers dedans. De même, dh_installmenu sait qu'il est nécessaire d'avoir un répertoire debian/I<paquet>/usr/share/menu/ avant d'installer les fichiers menu, etc.

source: ENVIRONMENT
fr: VARIABLES D'ENVIRONNEMENT

source: Set to 1 to enable verbose mode. Debhelper will output every command it runs that modifies files on the build system.
fr: Mettre cette variable à 1 valide le mode verbeux. Debhelper affichera chaque commande exécutée qui modifie des fichiers.

source: Temporarily specifies what compatibility level debhelper should run at, overriding any value in debian/compat.
fr: Indique temporairement le niveau de compatibilité auquel debhelper doit fonctionner. Cette valeur supplante la valeur précisée dans debian/compat.

source: Set to 1 to enable no-act mode.
fr: Mettre cette variable à 1 pour activer le mode simulation (no-act).

source: Anything in this variable will be prepended to the command line arguments of all debhelper commands. This is useful in some situations, for example, if you need to pass -p to all debhelper commands that will be run. One good way to set DH_OPTIONS is by using "Target-specific Variable Values" in your debian/rules file. See the make documentation for details on doing this.
fr: Le contenu de cette variable sera ajouté au début des arguments de chaque ligne de commande de debhelper. Ce comportement est utile dans quelques situations, par exemple, pour passer -p à toutes les commandes de debhelper qui seront exécutées. Une bonne façon d'employer DH_OPTIONS est d'utiliser des triplets S<« Cible-spécifique Variable Valeurs »> dans le fichier debian/rules. Consulter la documentation de make pour obtenir des précisions sur cette méthode.

source: If set, this adds the value the variable is set to to the -X options of all commands that support the -X option. Moreover, dh_builddeb will rm -rf anything that matches the value in your package build tree.
fr: Si cette variable possède une valeur, elle sera ajoutée à l'option -X de toutes les commandes qui admettent cette option. De plus, dh_builddeb fera un rm -rf quelque chose, correspondant à la valeur dans l'arbre de construction de paquet.

source: This can be useful if you are doing a build from a CVS source tree, in which case setting DH_ALWAYS_EXCLUDE=CVS will prevent any CVS directories from sneaking into the package you build. Or, if a package has a source tarball that (unwisely) includes CVS directories, you might want to export DH_ALWAYS_EXCLUDE=CVS in debian/rules, to make it take effect wherever your package is built.
fr: Ceci peut être utile pour construire un paquet à partir d'une arborescence CVS. Dans ce cas le réglage de DH_ALWAYS_EXCLUDE=CVS empêchera les répertoires CVS d'interférer subrepticement dans le paquet en construction. Ou, si un paquet possède une source compressée, (maladroitement) présente dans un répertoire CVS, il peut être utile d'exporter DH_ALWAYS_EXCLUDE=CVS dans debian/rules, pour que cette variable soit prise en compte quel que soit l'endroit où le paquet est construit.

source: Multiple things to exclude can be separated with colons, as in DH_ALWAYS_EXCLUDE=CVS:.svn
fr: Des exclusions multiples peuvent être séparées avec des deux points, comme dans DH_ALWAYS_EXCLUDE=CVS:.svn

source: SEE ALSO
fr: VOIR AUSSI

source: A set of example debian/rules files that use debhelper.
fr: Un ensemble d'exemples de fichiers debian/rules qui utilisent debhelper.

source: Debhelper web site.
fr: Le site internet de debhelper.

source: AUTHOR
fr: AUTEUR

source: B<dh_builddeb> [S<I<debhelper options>>] [B<--destdir=>I<directory>] [B<--filename=>I<name>] [S<B<--> I<params>>]
fr: B<dh_builddeb> [S<I<options de debhelper>>] [B<--destdir=>I<répertoire>] [B<--filename=>I<nom de fichier>] [S<B<--> I<paramètres>>]

source: dh_builddeb simply calls L<dpkg-deb(8)> to build a debian package or packages.
fr: dh_builddeb fait simplement appel à L<dpkg-deb(8)> pour construire un ou plusieurs paquet(s) Debian.

source: B<--destdir=>I<directory>
fr: B<--destdir=>I<répertoire>

source: Use this if you want the generated .deb files to be put in a directory other than the default of ".."
fr: Permet de stocker les fichiers .deb produits, dans un répertoire autre que le répertoire par défaut S<« .. »>.

source: B<--filename=>I<name>
fr: B<--filename=>I<nom>

source: Use this if you want to force the generated .deb file to have a particular file name. Does not work well if more than one .deb is generated!
fr: Permet que le fichier .deb produit porte un nom particulier. Cet argument ne fonctionne pas correctement si plus d'un fichier .deb est S<produit !>

source: B<-u>I<params>
fr: B<-u> I<paramètres>

source: B<--> I<params>
fr: B<--> I<paramètres>

source: Pass I<params> to L<dpkg-deb(1)> when it is used to build the package.
fr: Fournit les I<paramètres> à L<dpkg-deb(1)> lors de la construction du paquet.

source: This program is a part of debhelper.
fr: Ce programme fait partie de debhelper.

source: dh_clean - clean up package build directories
fr: dh_clean - nettoie le répertoire de construction du paquet

source: B<dh_clean> [S<I<debhelper options>>] [B<-k>] [B<-d>] [B<-X>I<item>] [S<I<file ...>>]
fr: B<dh_clean> [S<I<options de debhelper>>] [B<-k>] [B<-d>] [B<-X>I<élément>] [S<I<fichier ...>>]

source: Do not delete debian/files. When do you want to use this? Anytime you have a debian/rules that has 2 binary targets that build different .deb packages; for example, one target is binary-arch, and the other is binary-indep, or one target builds the shared library, and the other the -dev package. If you didn't use -k in these cases, then debian/files would be deleted in the middle, and your changes file will only contain the last binary package that was built.
fr: Empêche la suppression de debian/files. Il faut utiliser cette option à chaque fois que debian/rules comporte deux cibles différentes, entrainant la construction de deux paquets .deb. Par exemple, si une des cibles est binary-arch et l'autre est binary-indep, ou bien si on construit la bibliothèque partagée et le paquet -dev. Dans ces cas là, si -k n'était pas spécifié, debian/files serait supprimé au cours de l'opération et le fichier changes ne contiendrait que le dernier paquet binaire construit.

source: Only clean the package build directories, do not clean up any other files at all.
fr: Ne nettoie que les répertoires de construction du paquet. Ne supprime aucun autre fichier.

source: B<-X>I<item> B<--exclude=>I<item>
fr: B<-X>I<élément> B<--exclude=>I<élément>

source: Exclude files that contain "item" anywhere in their filename from being deleted, even if they would normally be deleted. You may use this option multiple times to build up a list of things to exclude.
fr: Conserve les fichiers qui contiennent S<« élément »>n'importe où dans leur nom, même s'ils auraient dû être normalement supprimés. Cette option peut être employée plusieurs fois afin d'exclure de la suppression une liste d'éléments.

source: I<file ...>
fr: I<fichier ...>

source: Delete these files too.
fr: Supprime également les fichiers listés.

source: dh_compress - compress files and fix symlinks in package build directories
fr: dh_compress - comprime les fichiers dans le répertoire de construction du paquet et modifie les liens symboliques en conséquence

source: B<dh_compress> [S<I<debhelper options>>] [B<-X>I<item>] [B<-A>] [S<I<file ...>>]
fr: B<dh_compress> [S<I<options de debhelper>>] [B<-X>I<élément>] [B<-A>] [S<I<fichier ...>>]

source: dh_compress is a debhelper program that is responsible for compressing the files in package build directories, and makes sure that any symlinks that pointed to the files before they were compressed are updated to point to the new files.
fr: dh_compress est un programme de la suite debhelper chargé de comprimer les fichiers dans le répertoire de construction du paquet. Il est également chargé de s'assurer que tous les liens symboliques qui pointaient sur les fichiers avant leur compression sont actualisés pour pointer sur les fichiers comprimés.

source: By default, dh_compress compresses files that debian policy mandates should be compressed, namely all files in usr/share/info, usr/share/man, usr/X11R6/man, files in usr/share/doc that are larger than 4k in size, (except the copyright file, .html and .css files, and files that appear to be already compressed based on their extensions), and all changelog files. Plus PCF fonts underneath usr/X11R6/lib/X11/fonts/ and usr/share/fonts/X11/
fr: Par défaut, dh_compress comprime les fichiers que la Charte Debian indique comme devant être comprimés. Cela concerne tous les fichiers de usr/share/info, usr/share/man, usr/X11R6/man, tous les fichiers changelog ainsi que les polices PCF stockées dans usr/X11R6/lib/X11/fonts/ et usr/share/fonts/X11/. Il comprimera également les fichiers de usr/share/doc qui font plus de 4ko, à l'exception du fichier de copyright, des fichiers suffixés .html et .css et des fichiers qui paraissent, de par leur extension, avoir déjà été comprimés.

source: Exclude files that contain "item" anywhere in their filename from being compressed. For example, -X.jpeg will exclude jpeg files from compression. You may use this option multiple times to build up a list of things to exclude. You can accomplish the same thing by using a debian/compress file, but this is easier.
fr: Permet d'exclure de la compression les fichiers qui comportent S<« élément »> n'importe où dans leur nom. Par exemple, -X.jpeg exclura de la compression les fichiers d'extension .jpeg. Cette option peut être employée plusieurs fois afin d'exclure une liste d'éléments. Le même résultat peut être obtenu avec un fichier debian/compress, mais -X est plus simple.

source: Compress all files specified by command line parameters in ALL packages acted on.
fr: Comprime tous les fichiers indiqués dans la ligne de commande et ce dans TOUS les paquets construits.

source: Add these files to the list of files to compress.
fr: Ajoute ces fichiers à la liste des fichiers à comprimer.

source: CONFORMS TO
fr: CONFORMITÉ

source: Debian policy, version 3.0
fr: Charte Debian, version 3.0

source: dh_desktop - Register .desktop files
fr: dh_desktop - inscrit les fichiers .desktop

source: dh_desktop is a debhelper program that registers .desktop files. Currently this program does not handle installation of the files, though it may do so at a later date. It takes care of adding maintainer script fragments to call F<update-desktop-database>.
fr: dh_desktop est un programme de la suite debhelper chargé de l'inscription des fichiers .desktop. Actuellement ce programme ne gère pas l'installation des fichiers, mais il pourrait bien le faire un jour. Il prend soin d'ajouter des lignes de code aux scripts de maintenance du paquet afin d'invoquer F<update-desktop-database>.

source: L<debhelper>
fr: L<debhelper(7)>

source: dh_fixperms - fix permissions of files in package build directories
fr: dh_fixperms - ajuste les droits sur les fichiers du répertoire de construction du paquet

source: B<dh_fixperms> [S<I<debhelper options>>] [B<-X>I<item>]
fr: B<dh_fixperms> [S<I<options de debhelper>>] [B<-X>I<élément>]

source: dh_fixperms is a debhelper program that is responsible for setting the permissions of files and directories in package build directories to a sane state -- a state that complies with Debian policy.
fr: dh_fixperms est un programme de la suite debhelper chargé de configurer correctement (c'est-à-dire conformément à la Charte Debian) les droits sur les fichiers et les sous-répertoires du répertoire de construction du paquet.

source: B<-X>I<item>, B<--exclude> I<item>
fr: B<-X>I<élément>, B<--exclude> I<élément>

source: Exclude files that contain "item" anywhere in their filename from having their permissions changed. You may use this option multiple times to build up a list of things to exclude.
fr: Permet d'exclure de la modification des droits les fichiers qui comportent S<« élément »>n'importe où dans leur nom. Cette option peut être employée plusieurs fois afin d'exclure une liste d'éléments.

source: dh_gconf - generate GConf schema registration scripts
fr: dh_gconf - produit les scripts d'enregistrement du schéma GConf

source: dh_gconf is a debhelper program that is responsible for registering GConf schemas.
fr: dh_gconf est un programme de la suite debhelper chargé de l'inscription des schémas GConf.

source: It automatically generates the postinst and prerm fragments needed to register and unregister the schemas in usr/share/gconf/schemas, using gconf-schemas.
fr: Il produit automatiquement les lignes de code dans les scripts de maintenance postinst et prerm nécessaires à l'inscription et à la radiation des schémas dans usr/share/gconf/schemas. Cette fonction utilise gconf-schemas.

source: If a file named debian/package.gconf-defaults exists, then it is installed into usr/share/gconf/defaults/10_package in the package build directory, with "package" replaced by the package name. Some postinst and postrm fragments will be generated to launch update-gconf-defaults.
fr: S'il existe un fichier nommé debian/paquet.gconf-defaults, il sera installé dans le répertoire de construction du paquet sous usr/share/gconf/defaults/10_paquet où le mot S<« paquet »> sera remplacé par le nom du paquet. Certaines parties des scripts de maintenance postinst et postrm seront produites pour exécuter update-gconf-defaults.

source: The gconf-schemas and update-gconf-defaults scripts are provided by the gconf2 package. An appropriate dependency will be generated in ${misc:Depends}.
fr: Les scripts gconf-schemas et update-gconf-defaults sont fournis par le paquet gconf2. La dépendance correspondante sera ajoutée dans ${misc:Depends}.

source: B<--priority> I<priority>
fr: B<--priority> I<priorité>

source: Use I<priority> (which should be a 2-digit number) as the defaults priority instead of 10. Higher values than ten can be used by derived distributions (20), CDD distributions (50), or site-specific packages (90).
fr: Détermine la I<priorité> (sous forme d'un nombre à deux chiffres) en remplacement de la priorité par défaut 10. Des valeurs plus élevées peuvent être utilisées pour les distribution dérivées (20), les distributions CDD (50), ou les paquets spécifiques à un site (90).

source: dh_gencontrol - generate and install control file
fr: dh_gencontrol - produit et installe le fichier de contrôle

source: B<dh_gencontrol> [S<I<debhelper options>>] [S<B<--> I<params>>]
fr: B<dh_gencontrol> [S<I<options debhelper>>] [S<B<--> I<paramètres>>]

source: dh_gencontrol is a debhelper program that is responsible for generating control files, and installing them into the DEBIAN directory with the proper permissions.
fr: dh_gencontrol est un programme de la suite debhelper chargé de la production des fichiers de contrôle et de leur installation dans le répertoire DEBIAN avec les droits appropriés.

source: Pass "params" to L<dpkg-gencontrol(1)>.
fr: Fournit S<« paramètres »> à L<dpkg-gencontrol(1)>.

source: dh_installcatalogs - install and register SGML Catalogs
fr: dh_installcatalogs - installe et inscrit les catalogues SGML

source: B<dh_installcatalogs> [S<I<debhelper options>>] [B<-n>]
fr: B<dh_installcatalogs> [S<I<options de debhelper>>] [B<-n>]

source: dh_installcatalogs is a debhelper program that installs and registers SGML catalogs. (Note: it will be extended for XML catalog registration when xml-core is available.) It complies with the Debian XML/SGML policy.
fr: dh_installcatalogs est un programme de la suite debhelper chargé d'installer et d'inscrire les catalogues SGML conformément à la Charte XML/SGML de Debian. (S<Nota :> Sa tâche sera étendue à l'inscription des catalogues XML dès que le socle xml sera disponible.)

source: The file F<debian/I<package>.sgmlcatalogs> contains the catalogs to be installed per package. Each line in that file should be of the form C<source dest>, where C<source> indicates where the catalog resides in the source tree, and C<dest> indicates the destination location for the catalog under the package build area. C<dest> should start with F</usr/share/sgml/>.
fr: Le fichier F<debian/I<paquet>.sgmlcatalogs> indique les catalogues qui seront installés par le paquet. Chaque ligne de ce fichier doit être sous la forme C<source destination>, où C<source> indique l'emplacement du catalogue dans l'arborescence source et où C<destination>indique son emplacement de destination au sein de l'arborescence de construction du paquet binaire. C<destination> doit commencer par F</usr/share/sgml/>.

source: Catalogs will be registered in a supercatalog, in F</etc/sgml/I<package>.cat>.
fr: Les catalogues seront inscrits dans le S« supercatalogue »> F</etc/sgml/I<paquet>.cat>.

source: Do not modify F<postinst>/F<postrm>/F<prerm> scripts.
fr: Empêche la modification des scripts de maintenance F<postinst>, F<postrm>, F<prerm>.

source: Note that this command is not idempotent. "dh_clean -k" should be called between invocations of this command. Otherwise, it may cause multiple instances of the same text to be added to maintainer scripts.
fr: S<Nota :> Ce programme n'est pas idempotent. Un S<« dh_clean B<-k> »> doit être réalisé entre chaque exécution de ce programme. Sinon, il risque d'y avoir plusieurs occurrences des mêmes lignes de code dans les scripts de maintenance du paquet.

source: dh_installchangelogs - install changelogs into package build directories
fr: dh_installchangelogs - installe les journaux de suivi des modifications (changelog) dans les répertoires de construction du paquet

source: B<dh_installchangelogs> [S<I<debhelper options>>] [B<-k>] [I<upstream>]
fr: B<dh_installchangelogs> [S<I<options de debhelper>>] [B<-k>] [I<journal-amont>]

source: dh_installchangelogs is a debhelper program that is responsible for installing changelogs into package build directories.
fr: dh_installchangelogs est le programme de la suite debhelper chargé de l'installation des journaux de suivi des modifications (changelog) dans les répertoires de construction du paquet.

source: dh_installchangelogs determines if the package is a debian native package, and if so, it installs debian/changelog into usr/share/doc/package/changelog in the package build directory. Otherwise, it installs debian/changelog into usr/share/doc/package/changelog.Debian in the package build directory. (If files named debian/package.changelog exist, they will be used in preference to debian/changelog.)
fr: dh_installchangelogs détermine si un paquet est un paquet Debian natif. Puis il copie le fichier debian/changelog dans le répertoire de construction du paquet sous usr/share/doc/paquet/changelog si c'est un paquet natif ou, sinon, sous usr/share/doc/paquet/changelog.Debian. Les fichiers nommés debian/paquet.changelog, s'ils existent, seront utilisés de préférence à debian/changelog.

source: Parallelling the debian changelog handling, this program also takes care of NEWS.Debian files. If there is a debian/NEWS file, it is installed as usr/share/doc/package/NEWS.Debian. debian/package.NEWS files can also be used.
fr: Parallèlement à la gestion des journaux de suivi des modifications, ce programme s'occupe également des fichiers NEWS.Debian. S'il existe un fichier debian/NEWS, il sera installé sous usr/share/doc/paquet/NEWS.Debian. Un fichier debian/paquet.NEWS peut également être utilisé.

source: If an upstream changelog file is specified as an option, then this upstream changelog will be installed as usr/share/doc/package/changelog in the package build directory. If the changelog is a html file (determined by file extension), it will be installed as usr/share/doc/package/changelog.html instead, and will be converted to plain text with html2text to generate usr/share/doc/package/changelog.
fr: Si un journal amont est spécifié, alors il sera installé sous usr/share/doc/paquet/changelog dans le répertoire de construction du paquet. Si le journal amont est un fichier html (d'après son extension) il sera installé sous usr/share/doc/paquet/changelog.html puis converti en S<« plain text »> avec S<« html2text »> afin de produire le fichier usr/share/doc/paquet/changelog.
