Repository: FedericoCeratto/debhelpers
Catalog: man/po4a/po/*.po
Languages: fr

source: NAME
fr: NOM

source: debhelper - the debhelper tool suite
fr: debhelper - ensemble d'outils regroupés sous le nom de debhelper

source: B<dh_>I<*> [B<-v>] [B<-a>] [B<-i>] [B<-s>] [B<--no-act>] [B<-ppackage>] [B<-Npackage] [-Ptmpdir>]
fr: B<dh_>I<*> [B<-v>] [B<-a>] [B<-i>] [B<-s>] [B<--no-act>] [B<-ppaquet>] [B<-Npaquet] [-Ptmpdir>]

source: Debhelper is used to help you build a debian package. The philosophy behind debhelper is to provide a collection of small, simple, and easily understood tools that are used in debian/rules to automate various common aspects of building a package. This means less work for you, the packager. It also, to some degree means that these tools can be changed if debian policy changes, and packages that use them will require only a rebuild to comply with the new policy.
fr: Debhelper facilite la construction des paquets Debian. La philosophie qui sous-tend debhelper est de fournir une collection de petits outils simples et facilement compréhensibles qui seront exploités dans debian/rules pour automatiser les tâches courantes liées à la construction des paquets, d'où un travail allégé pour le responsable. Dans une certaine mesure, cela signifie également que ces outils peuvent être adaptés aux modifications éventuelles de la Charte Debian. Les paquets qui utiliseront debhelper ne nécessiteront qu'une simple reconstruction pour être conformes aux nouvelles règles.

source: To create a new debian package using debhelper, you can just copy one of the sample rules files and edit it by hand. Or you can try the dh-make package, which contains a L<dh_make|dh_make(1)> command that partially automates the process. For a more gentle introduction, the maint-guide debian package contains a tutorial about making your first package using debhelper.
fr: Pour créer un nouveau paquet Debian en utilisant debhelper, il suffit de copier un des fichiers d'exemple et de le modifier manuellement. Il est possible également d'essayer le paquet dh-make qui contient une commande L<dh_make|dh_make(1)> automatisant partiellement le processus. Pour se familiariser avec ces concepts, le paquet Debian maint-guide contient un cours sur la construction d'un premier paquet avec debhelper.

source: DEBHELPER COMMANDS
fr: COMMANDES DE DEBHELPER

source: Here is the complete list of available debhelper commands. See their man pages for additional documentation.
fr: Voici la liste complète de commandes debhelper disponibles. Consulter leurs pages de manuel respectives pour obtenir des informations complémentaires.

source: If a program's name starts with "dh_", and the program is not on the above list, then it is not part of the debhelper package, but it should still work like the other programs described on this page.
fr: Si le nom d'un programme commence par S<« dh_ »> et qu'il n'est pas dans la liste ci-dessus, alors, c'est qu'il ne fait pas partie du paquet debhelper. Cependant, il devrait tout de même fonctionner comme les autres programmes décrits dans cette page.

source: DEBHELPER CONFIG FILES
fr: FICHIERS DE CONFIGURATION DE DEBHELPER

source: Many debhelper commands make use of files in F<debian/> to control what they do. Besides the common F<debian/changelog> and F<debian/control>, which are in all packages, not just those using debhelper, some additional files can be used to configure the behavior of specific debhelper commands. These files are typically named debian/package.foo (where "package" of course, is replaced with the package that is being acted on).
fr: Beaucoup de commandes de debhelper utilisent des fichiers du répertoire F<debian/> pour piloter leur fonctionnement. Outre les fichiers F<debian/changelog> et F<debian/control>, qui se trouvent dans tous les paquets, et pas seulement dans ceux qui emploient debhelper, d'autres fichiers peuvent servir à configurer le comportement des commandes spécifiques de debhelper. Ces fichiers sont, en principe, nommés debian/paquet.toto (où S<« paquet »> est, bien sûr, à remplacer par le nom du paquet concerné).

source: For example, dh_installdocs uses files named debian/package.docs to list the documentation files it will install. See the man pages of individual commands for details about the names and formats of the files they use. Generally, these files will list files to act on, one file per line. Some programs in debhelper use pairs of files and destinations or slightly more complicated formats.
fr: Par exemple, dh_installdocs utilise un fichier appelé debian/package.docs pour énumérer les fichiers de documentation qu'il installera. Consulter les pages de manuel des différentes commandes pour connaître le détail des noms et des formats des fichiers employés. D'une façon générale, ces fichiers de configuration énumèrent les fichiers sur lesquels devra porter l'action, à raison d'un fichier par ligne. Quelques programmes de debhelper emploient des paires fichier/destination voire des formats légèrement plus compliqués.

source: Note that if a package is the first (or only) binary package listed in debian/control, debhelper will use debian/foo if no debian/package.foo file can be found.
fr: S<Nota :> Lorsqu'un paquet est le premier (ou le seul) paquet binaire énuméré dans le fichier debian/control, debhelper exploitera debian/toto si aucun fichier debian/paquet.toto n'est présent.

source: In many cases, these config files are used to specify various types of files. Documentation or example files to install, files to move, and so on. When appropriate, in cases like these, you can use standard shell wildcard characters ('?' and '*' and '[..]' character classes) in the files.
fr: Dans beaucoup de cas, ces fichiers de configuration sont employés pour indiquer divers types de S<fichiers :> documentation, fichiers d'exemples à installer, fichiers à déplacer et ainsi de suite. Lorsque cela se justifie, dans des cas comme ceux-ci, il est possible d'employer les jokers (wildcard) standard de l'interpréteur de commandes (shell) (S<« ? »>, S<« * »> et S<« [..] »>).

source: You can also put comments in these files; lines beginning with "#" are ignored.
fr: Il est également possible de placer des commentaires dans ces fichiers. Les lignes débutant par S<« # »> sont ignorées.

source: SHARED DEBHELPER OPTIONS
fr: OPTIONS PARTAGÉES DE DEBHELPER

source: The following command line options are supported by all debhelper programs.
fr: Tous les programmes de debhelper acceptent les options S<suivantes :>

source: Verbose mode: show all commands that modify the package build directory.
fr: Mode S<verbeux :> affiche toutes les commandes qui modifient le répertoire de construction du paquet.

source: Do not really do anything. If used with -v, the result is that the command will output what it would have done.
fr: Empêche la construction de s'effectuer réellement. Si cette option est utilisée avec -v, le résultat sera l'affichage de ce que la commande aurait fait.

source: Act on all architecture dependent packages.
fr: Construit tous les paquets dépendants d'une architecture.

source: Act on all architecture independent packages.
fr: Construit tous les paquets indépendants de l'architecture.

source: B<->I<ppackage>, B<--package=>I<package>
fr: B<-p>I<paquet>, B<--package=>I<paquet>

source: Act on the package named "package". This option may be specified multiple times to make debhelper operate on a given set of packages.
fr: Construit le paquet nommé S<« paquet »>. Cette option peut être répétée afin de faire agir debhelper sur plusieurs paquets.

source: This is a smarter version of the -a flag, that is used in some rare circumstances. It understands that if the control file lists "Architecture: i386" for the package, the package should not be acted on on other architectures. So this flag makes the command act on all "Architecture: any" packages, as well as on any packages that have the current architecture explicitly specified. Contrast to the -a flag, which makes the command work on all packages that are not architecture independent.
fr: Il s'agit d'une version plus astucieuse de l'option -a, employée dans quelques rares cas. Grâce à cette option, si le fichier de contrôle du paquet comporte le champ S<« Architecture: i386 »>, debhelper ne construira pas le paquet pour d'autres architectures. De cette façon, cette option construit tous les paquets marqués S<«Architecture: any »> ainsi que tous les paquets dont l'architecture mentionnée correspond à l'architecture courante. Ce comportement est à l'opposé de l'option -a, qui construit seulement les paquets qui ne sont pas indépendants de l'architecture.

source: B<-N>I<package>, B<--no-package=>I<package>
fr: B<-N>I<paquet>, B<--no-package=>I<paquet>

source: Do not act on the specified package even if an -a, -i, or -p option lists the package as one that should be acted on.
fr: Exclut le paquet spécifié du processus de construction, même si l'option - a, -i ou -p l'impliquait.

source: Use "tmpdir" for package build directory. The default is debian/<package>
fr: Utilise le répertoire S<« tmpdir »> pour construire les paquets. Sinon, par défaut, le répertoire utilisé est S<« debian/I<paquet> »>

source: B<--mainpackage=>I<package>
fr: B<--mainpackage=>I<paquet>

source: This little-used option changes the package which debhelper considers the "main package", that is, the first one listed in debian/control, and the one for which debian/foo files can be used instead of the usual debian/package.foo files.
fr: Cette option, peu utilisée, indique à debhelper le nom du paquet principal pour lequel les fichiers debian/toto peuvent être utilisés à la place des fichiers habituels debian/paquet.toto. Par défaut, debhelper considère que le paquet principal est le premier paquet énuméré dans le fichier debian/control.

source: COMMON DEBHELPER OPTIONS
fr: OPTIONS COURANTES DE DEBHELPER

source: The following command line options are supported by some debhelper programs. See the man page of each program for a complete explanation of what each option does.
fr: Certains programmes de debhelper acceptent les options S<suivantes :> Consulter la page de manuel de chaque programme pour une explication complète du rôle de ces options.

source: Do not modify postinst/postrm/etc scripts.
fr: Ne pas modifier les scripts de maintenance du paquet (postinst, postrm, etc.).

source: B<-X>I<item>, B<--exclude=>I<item>
fr: B<-X>I<élément>, B<--exclude=>I<élément>

source: Exclude an item from processing. This option may be used multiple times, to exclude more than one thing.
fr: Permet d'exclure un élément du traitement. Cette option peut être employée plusieurs fois afin d'exclure plusieurs éléments.

source: Makes files or other items that are specified on the command line take effect in ALL packages acted on, not just the first.
fr: Précise que les fichiers (ou autres éléments) indiqués dans la ligne de commande concernent TOUS les paquets construits et pas seulement le premier.

source: NOTES
fr: REMARQUES

source: Multiple binary package support
fr: Prise en charge de plusieurs paquets binaires

source: If your source package generates more than one binary package, debhelper programs will default to acting on all binary packages when run. If your source package happens to generate one architecture dependent package, and another architecture independent package, this is not the correct behavior, because you need to generate the architecture dependent packages in the binary-arch debian/rules target, and the architecture independent packages in the binary-indep debian/rules target.
fr: Si le paquet source produit plus d'un paquet binaire, les programmes de debhelper construiront tous les paquets binaires. Si le paquet source doit construire un paquet dépendant de l'architecture, et un paquet indépendant de l'architecture, ce comportement ne conviendra pas. En effet, il convient de construire les paquets dépendants de l'architecture dans la cible binary-arch du fichier debian/rules, et les paquets indépendants de l'architecture dans la cible binary-indep.

source: To facilitate this, as well as give you more control over which packages are acted on by debhelper programs, all debhelper programs accept the B<-a>, B<-i>, B<-p>, and B<-s> parameters. These parameters are cumulative. If none are given, debhelper programs default to acting on all packages listed in the control file.
fr: Pour résoudre ce problème, et pour un meilleur contrôle sur la construction des paquets par debhelper, tous les programmes de debhelper acceptent les options B<-a>, B<-i>, B<-p>, et B<-s>. Ces options sont cumulatives. Si aucune n'est précisée, les programmes de debhelper construisent tous les paquets énumérés dans le fichier de contrôle.

source: Automatic generation of debian install scripts
fr: Génération automatique des scripts Debian de maintenance du paquet

source: Some debhelper commands will automatically generate parts of debian maintainer scripts. If you want these automatically generated things included in your existing debian maintainer scripts, then you need to add "#DEBHELPER#" to your scripts, in the place the code should be added. "#DEBHELPER#" will be replaced by any auto-generated code when you run dh_installdeb.
fr: Certaines commandes de debhelper produisent automatiquement des lignes de codes de maintenance du paquet. Pour les inclure dans vos propres scripts de maintenance du paquet, il convient d'ajouter S<« #DEBHELPER# »> à l'endroit où les lignes de code générées devront être insérées. S<« #DEBHELPER# »> sera remplacé, par les lignes de code générées automatiquement, lors de l'exécution de dh_installdeb.

source: If a script does not exist at all and debhelper needs to add something to it, then debhelper will create the complete script.
fr: Si un script de maintenance n'existe pas et que debhelper doit y inclure quelque chose, alors debhelper créera le script de maintenance complètement.

source: All debhelper commands that automatically generate code in this way let it be disabled by the -n parameter (see above).
fr: Toutes les commandes de debhelper qui produisent automatiquement des lignes de code de cette façon peuvent inhiber cette production grâce à l'option -n (voir ci-dessus).

source: Note that the inserted code will be shell code, so you cannot directly use it in a perl script. If you would like to embed it into a perl script, here is one way to do that (note that I made sure that $1, $2, etc are set with the set command):
fr: S<Nota :> Les lignes de code insérées seront écrit dans le langage de l'interpréteur de commandes (shell). De ce fait, il est impossible de les placer directement dans un script Perl. Pour les insérer dans un script Perl, voici une solution. (S'assurer que $1, $2, etc. sont bien définis par la commande set.)

source: my $temp="set -e\nset -- @ARGV\n" . << 'EOF'; #DEBHELPER# EOF system ($temp) / 256 == 0 or die "Problem with debhelper scripts: $!";
fr: my $temp="set -e\nset -- @ARGV\n" . << 'EOF'; #DEBHELPER# EOF system ($temp) / 256 == 0 or die "Problème avec le script de debhelper : $!";

source: Automatic generation of miscellaneous dependencies.
fr: Génération automatique des diverses dépendances.

source: Some debhelper commands may make the generated package need to depend on some other packages. For example, if you use L<dh_installdebconf(1)>, your package will generally need to depend on debconf. Or if you use L<dh_installxfonts(1)>, your package will generally need to depend on a particular version of xutils. Keeping track of these miscellaneous dependencies can be annoying since they are dependant on how debhelper does things, so debhelper offers a way to automate it.
fr: Certaines commandes de debhelper peuvent nécessiter des dépendances entre le paquet construit et d'autres paquets. Par exemple, si L<dh_installdebconf(1)> est employé, le paquet devra dépendre de debconf. Si L<dh_installxfonts(1)> est employé, le paquet deviendra dépendant d'une version particulière de xutils. Maintenir ces dépendances induites peut être pénible puisqu'elles découlent de la façon dont debhelper travaille. C'est pourquoi debhelper offre une solution d'automatisation.

source: All commands of this type, besides documenting what dependencies may be needed on their man pages, will automatically generate a substvar called ${misc:Depends}. If you put that token into your debian/control file, it will be expanded to the dependencies debhelper figures you need.
fr: Toutes les commandes de ce type, outre qu'elles documentent, dans leur page de manuel, les dépendances qu'elle induisent, généreront automatiquement une variable de substitution nommée ${misc:depends}. Si cette variable est exploitée dans le dossier debian/control, il sera automatiquement enrichi des dépendances induites par debhelper.

source: This is entirely independent of the standard ${shlibs:Depends} generated by L<dh_makeshlibs(1)>, and the ${perl:Depends} generated by L<dh_perl(1)>. You can choose not to use any of these, if debhelper's guesses don't match reality.
fr: Ce processus est entièrement indépendant de ${shlibs:Depends} standard, produite par L<dh_makeshlibs(1)>, et de ${perl:Depends} produite par L<dh_perl(1)>. Il est également possible de choisir de ne pas les utiliser si les conjectures de debhelper ne correspondent pas la réalité.

source: Package build directories
fr: Répertoires de construction du paquet

source: By default, all debhelper programs assume that the temporary directory used for assembling the tree of files in a package is debian/<package>.
fr: Par défaut, tous les programmes de debhelper supposent que le répertoire temporaire utilisé pour construire l'arborescence des fichiers d'un paquet est debian/I<paquet>.

source: Sometimes, you might want to use some other temporary directory. This is supported by the -P flag. For example, "dh_installdocs -Pdebian/tmp", will use debian/tmp as the temporary directory. Note that if you use -P, the debhelper programs can only be acting on a single package at a time. So if you have a package that builds many binary packages, you will need to also use the -p flag to specify which binary package the debhelper program will act on.
fr: Parfois, il peut être souhaitable d'utiliser un autre répertoire temporaire. Ceci est obtenu grâce au paramètre -P. Par exemple, S<« dh_installdocs -Pdebian/tmp »> utilisera debian/tmp comme répertoire temporaire. S<Nota :> L'usage de -P implique que les programmes de debhelper ne construisent qu'un seul paquet à la fois. De ce fait, si le paquet source génère plusieurs paquets binaires, il faudra employer également le paramètre -p pour préciser l'unique paquet binaire à construire.

source: Debhelper compatibility levels
fr: Niveaux de compatibilité de debhelper

source: From time to time, major non-backwards-compatible changes need to be made to debhelper, to keep it clean and well-designed as needs change and its author gains more experience. To prevent such major changes from breaking existing packages, the concept of debhelper compatibility levels was introduced. You tell debhelper which compatibility level it should use, and it modifies its behavior in various ways.
fr: Parfois, des modifications majeures de debhelper doivent être faites et vont briser la compatibilité ascendante. Ces modifications sont nécessaires pour conserver à debhelper ses qualités de conception et d'écriture, car les besoins changent et le savoir-faire de l'auteur s'améliore. Pour éviter que de tels changements ne cassent les paquets existants, un concept de niveau de compatibilité debhelper a été introduit. On précisera à debhelper le niveau de compatibilité qu'il doit employer, et il modifiera son comportement de diverses manières.

source: Unless otherwise indicated, all debhelper documentation assumes that you are using the most recent compatibility level, and in most cases does not indicate if the behavior is different in an earlier compatibility level, so if you are not using the most recent compatibility level, you're advised to read below for notes about what is different in earlier compatibility levels.
fr: Sauf indication contraire, toute la documentation de debhelper suppose l'utilisation du niveau de compatibilité le plus récent, et, dans la plupart des cas ne précise pas si le comportement est différent avec les niveaux de compatibilité antérieurs. De ce fait, si le niveau de compatibilité le plus récent n'est pas celui utilisé, il est fortement conseillé de lire les indications ci-dessous qui exposent les différences dans les niveaux de compatibilité antérieurs.

source: These are the available compatibility levels:
fr: Les niveaux de compatibilité sont les S<suivants :>

source: This is the original debhelper compatibility level, and so it is the default one. In this mode, debhelper will use debian/tmp as the package tree directory for the first binary package listed in the control file, while using debian/<package> for all other packages listed in the control file.
fr: C'est le niveau initial de compatibilité de debhelper ainsi que la valeur par défaut. Dans ce mode, debhelper emploiera debian/tmp comme répertoire de l'arborescence du premier paquet binaire énuméré dans le fichier de contrôle et debian/I<paquet> pour tous les autres. Ce mode est déconseillé.

source: This mode is deprecated.
fr: Ce mode est déconseillé.

source: In this mode, debhelper will consistently use debian/<package> as the package tree directory for every package that is built.
fr: Dans ce mode, debhelper emploiera uniformément debian/I<paquet> comme répertoire de l'arborescence de chaque paquet construit.

source: This mode works like V2, with the following additions:
fr: Ce mode fonctionne comme V2 mais avec les ajouts S<suivants :>

source: Debhelper config files support globbing via * and ?, when appropriate. To turn this off and use those characters raw, just prefix with a backslash.
fr: Les fichiers de configuration de debhelper acceptent les jokers * et ? lorsque cela a un sens. Pour désactiver cette substitution et utiliser ces caractères tels quels, il suffit de les préfixer avec une barre contre-oblique (backslash).

source: dh_makeshlibs makes the postinst and postrm scripts call ldconfig.
fr: Les scripts de maintenance du paquet (postinst et postrm) feront appel à ldconfig quand dh_makeshlibs sera lancé.

source: Every file in etc/ is automatically flagged as a conffile by dh_installdeb.
fr: Chaque fichier de etc/ est automatiquement marqué par dh_installdeb comme un fichier de configuration.

source: Changes from V3 are:
fr: Les changements par rapport à la version 3 S<sont :>

source: dh_makeshlibs -V will not include the debian part of the version number in the generated dependency line in the shlibs file.
fr: dh_makeshlibs -V n'inclura pas la partie Debian du numéro de version dans la ligne de dépendance produite dans le fichier shlibs.

source: You are encouraged to put the new ${misc:Depends} into debian/control to supplement the ${shlibs:Depends} field.
fr: Il est fortement conseillé de mettre le nouveau ${misc:Depends} dans debian/control pour compléter ${shlibs:Depends}.

source: dh_fixperms will make all files in bin/ directories and in etc/init.d executable.
fr: dh_fixperms rendra exécutables tous les fichiers des répertoires bin/ et etc/init.d.

source: dh_link will correct existing links to conform with policy.
fr: dh_link corrigera les liens existants pour les rendre conformes à la Charte Debian.

source: Comments are ignored in debhelper config files.
fr: Les commentaires sont ignorés dans les fichiers de configuration de debhelper.
