Repository: FedericoCeratto/debhelpers
Catalog: man/po4a/po/*.po
Languages: fr

source: Keep the original name of the upstream changelog. This will be accomplished by installing the upstream changelog as "changelog", and making a symlink from that to the original name of the changelog file. This can be useful if the upstream changelog has an unusual name, or if other documentation in the package refers to the changelog file.
fr: Conserve le nom original du journal amont. Ce résultat est obtenu en installant le journal amont sous le nom S<« changelog »> et en créant un lien symbolique portant le nom d'origine et pointant sur le fichier S<« changelog »>. Cela peut être utile si le journal amont porte un nom inhabituel ou si d'autres éléments de documentation du paquet se réfèrent à ce fichier.

source: I<upstream>
fr: I<journal-amont>

source: Install this file as the upstream changelog.
fr: Installe ce fichier en tant que journal amont de suivi des modifications.

source: dh_installcron - install cron scripts into etc/cron.*
fr: dh_installcron - installe les scripts cron dans etc/cron.*

source: B<dh_installcron> [S<B<debhelper options>>] [B<--name=>I<name>]
fr: B<dh_installcron> [S<B<option de debhelper>>] [B<--name=>I<nom>]

source: dh_installcron is a debhelper program that is responsible for installing cron scripts into etc/cron.*/ in package build directories. The files debian/package.cron.daily, debian/package.cron.weekly, debian/package.cron.monthly, debian/package.cron.hourly, and debian/package.cron.d are installed.
fr: dh_installcron est le programme de la suite debhelper chargé d'installer des scripts cron dans le répertoire de construction du paquet sous S<« etc/cron.*/ »>. Ce processus installe les fichiers debian/paquet.cron.daily, debian/paquet.cron.weekly, debian/paquet.cron.monthly, debian/paquet.cron.hourly et debian/paquet.cron.d.

source: B<--name=>I<name>
fr: B<--name=>I<nom>

source: Look for files named debian/package.name.cron.* and install them as etc/cron.*/name, instead of using the usual files and installing them as the package name.
fr: Recherche les fichiers appelés debian/paquet.nom.cron.* et les installe sous etc/cron.*/nom, au lieu d'utiliser les fichiers habituels et de les installer en leur donnant le nom du paquet.

source: dh_installdebconf - install files used by debconf in package build directories
fr: dh_installdebconf - installe les fichiers utilisés par debconf dans les répertoires de construction du paquet

source: B<dh_installdebconf> [S<I<debhelper options>>] [B<-n>] [S<B<--> I<params>>]
fr: B<dh_installdebconf> [S<I<options de debhelper>>] [B<-n>] [S<B<--> I<paramètres>>]

source: dh_installdebconf is a debhelper program that is responsible for installing files used by the debconf package into package build directories.
fr: dh_installdebconf est le programme de la suite debhelper chargé d'installer les fichiers utilisés par debconf dans les répertoires de construction du paquet.

source: Files named debian/package.config and debian/package.templates are installed into the DEBIAN directory in the package build directory. If a file named debian/package.config.debhelper exists, the contents of that file are merged into the config script as follows: If the script exists, then anywhere in it that "#DEBHELPER#" appears, the text of the .debhelper file is inserted. If the script does not exist, then a script is generated from the .debhelper file. The .debhelper files may be created by other debhelper programs, and are shell script fragments.
fr: Les fichiers nommés debian/paquet.config et debian/paquet.templates sont installés dans le répertoire DEBIAN du répertoire de construction du paquet. S'il existe un fichier nommé debian/I<paquet>.config.debhelper, son contenu est fusionné avec le script correspondant en remplaçant chacune des occurrences de S<« #DEBHELPER# »> par le contenu du fichier .debhelper correspondant. Si le script n'existe pas, alors il est généré à partir du fichier .debhelper. Les fichiers .debhelper peuvent être créés par d'autres programmes de debhelper et sont formés de lignes de code écrites dans le langage de l'interpréteur de commandes (shell).

source: Note that if you use debconf, your package probably needs to depend on it (it will be added to ${misc:Depends} by this program).
fr: S<Nota :> Comme un paquet qui utilise debconf a probablement besoin d'en dépendre, ce programme ajoute cette dépendance à ${misc:Depends}.

source: Note that for your config script to be called by dpkg, your postinst needs to source debconf's confmodule. dh_installdebconf does not install this statement into postinst automatically as it it too hard to do it right.
fr: S<Nota :> Étant donné que le script de configuration est invoqué par dpkg, postinst doit comporter le module de configuration (confmodule) de debconf. dh_installdebconf n'implémente pas automatiquement ce traitement dans le script de maintenance postinst car ce serait trop difficile à faire correctement.

source: LOCALIZED TEMPLATE FILES
fr: FICHIERS D'ADAPTATION LINGUISTIQUE

source: This program will look to see if you have a debian/po directory and if so will automatically call L<po2debconf(1)> to generate a merged templates file containing the translations. For this to work, your package should build-depend on po-debconf.
fr: dh_installdebconf vérifie s'il existe un répertoire debian/po. Dans l'affirmative, il lancera automatiquement L<po2debconf(1)> pour produire un fichier multilingue. Pour que cela fonctionne, le paquet doit dépendre, pour sa construction (build-depend), de po-debconf.

source: Do not modify postrm script.
fr: Empêche la modification du script de maintenance postrm.

source: Pass the params to po2debconf.
fr: Passe les paramètres à po2debconf.

source: dh_installdeb - install files into the DEBIAN directory
fr: dh_installdeb - installe des fichiers dans le répertoire DEBIAN

source: B<dh_installdeb> [S<I<debhelper options>>]
fr: B<dh_installdeb> [S<I<options de debhelper>>]

source: dh_installdeb is a debhelper program that is responsible for installing files into the DEBIAN directories in package build directories with the correct permissions.
fr: dh_installdeb est le programme de la suite debhelper chargé de l'installation des fichiers dans le répertoire DEBIAN du répertoire de construction du paquet ainsi que du réglage correct des droits sur ces fichiers.

source: The postinst, preinst, postrm, and prerm are handled specially: If a corresponding file named debian/package.script.debhelper exists, the contents of that file are merged into the script as follows: If the script exists, then anywhere in it that "#DEBHELPER#" appears, the text of the .debhelper file is inserted. If the script does not exist, then a script is generated from the .debhelper file. The .debhelper files are created by other debhelper programs, such as L<dh_installmenu(1)>, and are shell script fragments.
fr: Les scripts de maintenance postinst, preinst, postrm et prerm sont gérés de manière S<particulière :> s'il existe un fichier nommé debian/I<paquet>.I<script>.debhelper, alors son contenu est fusionné avec le script correspondant en remplaçant chacune des occurrences de S<« #DEBHELPER# »> par le contenu du fichier .debhelper correspondant. Si le script n'existe pas, alors il est généré à partir du fichier .debhelper. Les fichiers .debhelper sont produits par d'autres programmes de debhelper, tels que L<dh_installmenu(1)>, et sont formés de lignes de code écrites dans le langage de l'interpréteur de commandes (shell).

source: In V3 compatibility mode and higher, all files in the etc/ directory in a package will automatically be flagged as conffiles by this program, so there is no need to list them manually in package.conffiles.
fr: A partir du niveau de compatibilité V3, tous les fichiers du répertoire etc/ du paquet construit sont automatiquement marqués comme fichiers de configuration. De ce fait, il est inutile de les énumérer dans package.conffiles.

source: dh_installdirs - create subdirectories in package build directories
fr: dh_installdirs - crée des sous-répertoires dans le répertoire de construction du paquet

source: B<dh_installdirs> [S<I<debhelper options>>] [B<-A>] [S<I<dir ...>>]
fr: B<dh_installdirs> [S<I<options de debhelper>>] [B<-A>] [S<I<répertoire ...>>]

source: dh_installdirs is a debhelper program that is responsible for creating subdirectories in package build directories.
fr: dh_installdirs est le programme de la suite debhelper chargé de la création des sous-répertoires dans le répertoire de construction du paquet.

source: Any directory names specified as parameters will be created in the package build directory of the first package dh_installdirs is told to act on. By default, this is the first binary package in debian/control, but if you use -p, -i, or -a flags, it will be the first package specified by those flags.
fr: Tous les sous-répertoires indiqués en paramètres seront créés dans le répertoire de construction du premier paquet traité par dh_installdirs. Par défaut, il s'agit du premier paquet indiqué dans le fichier debian/control, mais, si les options -p, -i ou -a sont utilisées, il s'agira du premier paquet indiqué par ces options.

source: Create any directories specified by command line parameters in ALL packages acted on, not just the first.
fr: Crée l'ensemble des répertoires indiqués en ligne de commande dans TOUS les paquets construits et pas seulement dans le premier.

source: I<dir ...>
fr: I<répertoire ...>

source: Create these directories in the package build directory of the first package acted on. (Or in all packages if -A is specified.)
fr: Crée les répertoires indiqués dans le répertoire de construction du premier paquet traité (ou de tous les paquets traités si -A est indiqué).

source: dh_installdocs - install documentation into package build directories
fr: dh_installdocs - installe la documentation dans le répertoire de construction du paquet

source: B<dh_installdocs> [S<I<debhelper options>>] [B<-A>] [B<-n>] [B<-X>I<item>] [S<I<file ...>>]
fr: B<dh_installdocs> [S<I<options de debhelper>>] [B<-A>] [B<-n>] [B<-X>I<élément>] [S<I<fichier ...>>]

source: dh_installdocs is a debhelper program that is responsible for installing documentation into usr/share/doc/package in package build directories.
fr: dh_installdocs est le programme de la suite debhelper chargé de l'installation de la documentation dans le répertoire usr/share/doc/paquet du répertoire de construction du paquet.

source: dh_installdocs automatically installs debian/copyright if it exists. If dh_installdocs is acting on multiple packages, debian/copyright files will be installed into all packages. However, if you need to have separate copyright files for different binary packages, you can use files named debian/package.copyright.
fr: dh_installdocs installe automatiquement, s'il existe, le fichier debian/copyright. Si dh_installdocs traite plusieurs paquets, debian/copyright sera installé dans chacun des paquets. Toutefois, s'il est nécessaire d'avoir des licences distinctes pour chaque paquet, il est possible d'utiliser des fichiers nommés debian/paquet.copyright.

source: Any filenames specified as parameters will be installed into the first package dh_installdocs is told to act on. By default, this is the first binary package in debian/control, but if you use B<-p>, B<-i>, or B<-a> flags, it will be the first package specified by those flags.
fr: Tous les fichiers indiqués en paramètres de la ligne de commande seront installés dans le premier paquet traité par dh_installdirs. Par défaut, il s'agit du premier paquet indiqué dans le fichier debian/control, mais, si les options B<-p>, B<-i> ou B<-a> sont utilisées, il s'agira du premier paquet indiqué par ces options.

source: Also, debian/README.Debian (or debian/README.debian) and debian/TODO, if they exist, will be installed into the first binary package listed in debian/control, if dh_installdocs is acting on that package. Note that debian/TODO will be installed named TODO.Debian, if the package is not a debian native package. Also note that README.debian is installed as README.Debian, for consistency. Note that debian/package.README.Debian and debian/package.TODO can be used to specify files for subpackages.
fr: De la même façon, s'ils existent, les fichiers debian/README.Debian (ou debian/README.debian) et debian/TODO seront installés dans le premier paquet binaire indiqué dans le fichier debian/control, si dh_installdocs traite ce paquet. S<Nota :> Si le paquet n'est pas natif Debian, le fichier debian/TODO sera installé sous le nom TODO.Debian. Pour des raisons de cohérence, le fichier README.debian est installé sous le nom de README.Debian. Enfin, des fichiers debian/paquet/README.Debian et debian/paquet.TODO peuvent être utilisés pour fournir des fichiers TODO et README aux sous-paquets.

source: Files named debian/package.docs can list other files to be installed.
fr: Des fichiers nommés debian/paquet.docs peuvent être employés pour énumérer d'autres fichiers de documentation à installer.

source: Files named debian/package.doc-base, will be installed as doc-base control files, and will make this program automatically generate the postinst and prerm commands needed to interface with the doc-base package. Note that the doc-id will be determined from the "Document:" entry in the doc-base control file in question.
fr: Les fichiers nommés debian/paquet.doc-base, seront installés en tant que fichiers de contrôle doc-base et feront produire à dh_installdocs les lignes de code des scripts de maintenance postinst et prerm nécessaires à l'interfaçage avec le paquet doc-base. S<Nota :> L'identificateur de documentation (doc-id) sera fixé d'après l'indication du champ S<« Document: »> du fichier de contrôle doc-base en question.

source: If your package needs to register more than one document, you need multiple files. To accomplish this, you can use files named debian/package.doc-base.*
fr: Si le paquet nécessite l'inscription d'un ou de plusieurs documents, il faudra utiliser plusieurs fichiers. Pour obtenir ce résultat, il est possible d'utiliser des fichiers nommés debian/paquet.doc-base.*

source: Install all files specified by command line parameters in ALL packages acted on.
fr: Installe l'ensemble des fichiers indiqués sur la ligne de commande dans TOUS les paquets construits.

source: Do not modify postinst/prerm scripts.
fr: Empêche la modification des scripts de maintenance postinst et prerm.

source: B<-Xitem>, B<--exclude=item>
fr: B<-Xélément>, B<--exclude=élément>

source: Exclude files that contain "item" anywhere in their filename from being installed. Note that this includes doc-base files.
fr: Exclut les fichiers qui comportent S<« élément »>, n'importe où dans leur nom, de l'installation. Il est à noter que cela inclut les fichiers doc-base.

source: Install these files as documentation into the first package acted on. (Or in all packages if B<-A> is specified).
fr: Installe les fichiers indiqués en tant que documentation du premier paquet traité (ou de tous les paquets traités si -A est indiqué).

source: EXAMPLES
fr: EXEMPLES

source: This is an example of a debian/package.docs file:
fr: Voici un exemple de fichier S<debian/paquet.docs :>

source: Note that dh_installdocs will happily copy entire directory hierarchies if you ask it to (similar to cp -a). If it is asked to install a directory, it will install the complete contents of the directory.
fr: S<Nota :> Heureusement, dh_installdocs sait copier des hiérarchies entières de répertoire (comme un cp -a). Si on lui demande d'installer un répertoire, il installera le contenu complet du répertoire.

source: Note that this command is not idempotent. "dh_clean B<-k>" should be called between invocations of this command. Otherwise, it may cause multiple instances of the same text to be added to maintainer scripts.
fr: S<Nota :> Ce programme n'est pas idempotent. Un S<« dh_clean B<-k> »> doit être réalisé entre chaque exécution de ce programme. Sinon, cela pourrait causer l'ajout de plusieurs occurrences des mêmes lignes de code dans les scripts de maintenance du paquet.

source: dh_installemacsen - register an emacs add on package
fr: dh_installemacsen - inscrit un paquet additionnel emacs

source: B<dh_installemacsen> [S<I<debhelper options>>] [B<-n>] [B<--priority=>I<n>] [B<--flavor=>I<foo>]
fr: B<dh_installemacsen> [S<I<options de debhelper>>] [B<-n>] [B<--priority=>I<n>] [B<--flavor=>I<toto>]

source: dh_installemacsen is a debhelper program that is responsible for installing files used by the debian emacsen-common package into package build directories.
fr: dh_installemacsen est le programme de la suite debhelper chargé de l'installation, dans le répertoire de construction du paquet, des fichiers utilisés par le paquet emacsen-common.

source: If a file named debian/package.emacsen-install exists, then it is installed into usr/lib/emacsen-common/packages/install/package in the package build directory. Similarly, debian/package.emacsen-remove is installed into usr/lib/emacsen-common/packages/remove/package . And similarly, debian/package.emacsen-startup is installed into etc/emacs/site-start.d/50<package>.el (by default).
fr: S'il existe un fichier nommé debian/paquet.emacsen-install alors il est installé dans le répertoire de construction du paquet sous usr/lib/emacsen-common/paquet/install/paquet. De la même manière, debian/paquet.emacsen-remove est installé dans usr/lib/emacsen-common/paquet/remove/paquet et debian/paquet.emacsen-startup dans etc/emacs/site-start.d/50<paquet>.el (par défaut).

source: Sets the priority number of a site-start.d file. Default is 50.
fr: Fixe le numéro de priorité du fichier site-start.d. La valeur par défaut est 50.

source: B<--flavor=>I<foo>
fr: B<--flavor=>I<toto>

source: Sets the flavor a site-start.d file will be installed in. Default is "emacs", alternatives include "xemacs" and "emacs20".
fr: Fixe la S<« saveur »> dans laquelle le fichier site-start.d sera installé. La valeur par défaut est S<« emacs »>. Les autres valeurs possibles sont S<« xemacs »> et S<« emacs20 »>.

source: dh_installexamples - install example files into package build directories
fr: dh_installexamples - installe les fichiers d'exemples dans le répertoire de construction du paquet

source: B<dh_installexamples> [S<I<debhelper options>>] [B<-A>] [B<-X>I<item>] [S<I<file ...>>]
fr: B<dh_installexamples> [S<I<options de debhelper>>] [B<-A>] [B<-X>I<élément>] [S<I<fichier ...>>]

source: dh_installexamples is a debhelper program that is responsible for installing examples into usr/share/doc/package/examples in package build directories.
fr: dh_installexamples est le programme de la suite debhelper chargé de l'installation des exemples, dans le répertoire de construction du paquet, sous usr/share/doc/package/examples.

source: Any file names specified as parameters will be installed into the first package dh_installexamples is told to act on. By default, this is the first binary package in debian/control, but if you use -p, -i, or -a flags, it will be the first package specified by those flags.
fr: Tous les fichiers indiqués en paramètres de la ligne de commande seront installés dans le premier paquet traité par dh_installexamples. Par défaut, il s'agit du premier paquet indiqué dans le fichier debian/control, mais, si les options -p, -i ou -a sont utilisées, il s'agira du premier paquet indiqué par ces options.

source: Files named debian/package.examples can list other files to be installed.
fr: Des fichiers nommés debian/paquet.examples peuvent être utilisés pour énumérer les autres fichiers qui doivent être installés.

source: Install any files specified by command line parameters in ALL packages acted on.
fr: Installe l'ensemble des fichiers indiqués sur la ligne de commande dans TOUS les paquets construits.

source: Install these files as examples into the first package acted on. (Or into all packages if -A is specified.)
fr: Installe les fichiers indiqués en tant qu'exemples dans le premier paquet construit (ou dans tous les paquets si -A est spécifié).

source: Exclude files that contain "item" anywhere in their filename from being installed.
fr: Exclut du traitement les fichiers qui comportent S<« élément »> n'importe où dans leur nom.

source: Note that dh_installexamples will happily copy entire directory hierarchies if you ask it to (similar to cp -a). If it is asked to install a directory, it will install the complete contents of the directory.
fr: S<Nota :> Heureusement, dh_installexamples sait copier des hiérarchies entières de répertoire (comme un cp -a). Si on lui demande d'installer un répertoire, il installera le contenu complet du répertoire.

source: dh_installinfo - install and register info files
fr: dh_installinfo - installe et inscrit les fichiers info

source: B<dh_installinfo> [S<I<debhelper options>>] [B<-A>] [B<-n>] [S<I<file ...>>]
fr: B<dh_installinfo> [S<I<options de debhelper>>] [B<-A>] [B<-n>] [S<I<fichier ...>>]

source: dh_installinfo is a debhelper program that is responsible for installing info files and registering the files it installs with install-info.
fr: dh_installinfo est le programme de la suite debhelper chargé de l'installation des fichiers info et de leur inscription avec install-info.

source: Note that install-info determines some information about the info files by parsing them, in particular, it looks at the INFO-DIR-SECTION line to determine what section the info file belongs in.
fr: S<Nota :> install-info détermine certaines informations concernant les fichiers info en les analysant. En particulier, il regarde la ligne INFO-DIR-SECTION pour déterminer la section à laquelle le fichier info appartient.

source: Any filenames specified as parameters will be installed into the first package dh_installinfo is told to act on. By default, this is the first binary package in debian/control, but if you use -p, -i, or -a flags, it will be the first package specified by those flags.
fr: Tous les fichiers indiqués en paramètres de la ligne de commande seront installés dans le premier paquet traité par dh_installinfo. Par défaut, il s'agit du premier paquet indiqué dans le fichier debian/control, mais, si les options -p, -i ou -a sont utilisées, il s'agira du premier paquet indiqué par ces options.

source: Files named debian/package.info can list other files to be installed.
fr: Des fichiers nommés debian/paquet.info peuvent indiquer d'autres fichiers à installer.

source: Install these info files into the first package acted on. (Or in all packages if -A is specified).
fr: Installe les fichiers info dans le premier paquet construit (ou dans tous les paquets si -A est spécifié).

source: dh_installinit - install init scripts into package build directories
fr: dh_installinit - installe les scripts d'initialisation (init scripts) dans le répertoire de construction du paquet

source: B<dh_installinit> [S<I<debhelper options>>] [B<--name=>I<name>] [B<-n>] [B<-r>] [B<-d>] [S<B<--> I<params>>]
fr: B<dh_installinit> [S<I<options de debhelper>>] [B<--name=>I<nom>] [B<-n>] [B<-r>] [B<-d>] [S<B<--> I<paramètres>>]

source: dh_installinit is a debhelper program that is responsible for installing init scripts and associated defaults files into package build directories.
fr: dh_installinit est le programme de la suite debhelper chargé de l'installation des scripts d'initialisation et des fichiers S<« defaults »> associés, dans le répertoire de construction du paquet.
