Repository: FedericoCeratto/debhelpers
Catalog: man/po4a/po/*.po
Languages: fr

source: This program may be used in one of two ways. If you just have a file or two that the upstream Makefile does not install for you, you can run dh_install on them to move them into place. On the other hand, maybe you have a large package that builds multiple binary packages. You can use the upstream Makefile to install it all into debian/tmp, and then use dh_install to copy directories and files from there into the proper package build directories.
fr: Ce programme peut être utilisé de deux façons différentes. S'il n'y a qu'un ou deux fichiers que Makefile n'installe pas de lui même, il suffit d'exécuter dh_install en le configurant pour installer ces fichiers. Par contre, avec un paquet source qui construit plusieurs paquets binaires il est préférable de demander à Makefile de mettre tout dans debian/tmp puis d'utiliser dh_install pour déplacer répertoires et fichiers depuis cet emplacement temporaire vers les répertoires de construction appropriés de chaque paquet.

source: Guess as the destination directory to install things to. If this is specified, you should not list destination directories in debian/package.install files or on the command line. Instead, dh_install will guess as follows:
fr: Avec ce paramètre, dh_install détermine de lui-même le répertoire de destination des éléments installés. Si cette option est spécifiée, il ne faut indiquer les répertoires de destination, ni dans les fichiers debian/paquet.install, ni en ligne de commande. dh_install détermine les répertoires de destination selon la règle S<suivante :>

source: Strip off debian/tmp (or the sourcedir if one is given) from the front of the filename, if it is present, and install into the dirname of the filename. So if the filename is debian/tmp/usr/bin, then that directory will be copied to debian/package/usr/. If the filename is debian/tmp/etc/passwd, it will be copied to debian/package/etc/.
fr: Il enlève debian/tmp (ou le nom du répertoire source, s'il a été indiqué) du début du chemin du fichier, s'il est présent, et copie le fichier dans le répertoire de construction du paquet, sous l'arborescence indiquée pour le fichier source. Par exemple, si l'objet à installer est le répertoire debian/tmp/usr/bin, alors il sera copié dans debian/paquet/usr/. Si le fichier à installer est debian/tmp/etc/passwd, il sera copié dans debian/paquet/etc/.

source: Note that if you list exactly one filename or wildcard-pattern on a line by itself in a debian/package.install file, with no explicit destination, then dh_install will automatically guess the destination even if this flag is not set.
fr: S<Nota :> Si le nom du fichier (ou le motif d'un ensemble de fichiers) est indiqué sur une ligne du fichier debian/paquet.install, sans que la destination soit précisée, alors dh_install déterminera automatiquement la destination, même en l'absence de l'option B<--autodest>.

source: This option makes dh_install keep track of the files it installs, and then at the end, compare that list with the files in the source directory. If any of the files (and symlinks) in the source directory were not installed to somewhere, it will warn on stderr about that.
fr: Cette option impose à dh_install de garder la trace des fichiers qu'il installe et, à la fin, de comparer cette liste aux fichiers du répertoire source. Si un des fichiers (ou des liens symboliques) du répertoire source, n'était pas installé quelque part, il le signalerait par un message sur stderr.

source: This may be useful if you have a large package and want to make sure that you don't miss installing newly added files in new upstream releases.
fr: Cette option peut être utile dans le cas d'un gros paquet pour lequel on veut être certain de ne pas oublier l'installation d'un des nouveaux fichiers récemment ajoutés dans la version.

source: Note that files that are excluded from being moved via the -X option are not warned about.
fr: S<Nota :> Les fichiers qui sont exclus par l'option -X n'entraînent aucun message d'erreur.

source: This option is like --list-missing, except if a file was missed, it will not only list the missing files, but also fail with a nonzero exit code.
fr: Cette option est similaire à --list-missing, sauf que, si un fichier est oublié, cela produira non seulement un message sur stderr mais également un echec du programme avec une valeur de retour différente de zéro.

source: B<--sourcedir=dir>
fr: B<--sourcedir=répertoire>

source: Makes all source files be found under dir. If this is specified, it is akin to all the source filenames having "dir/" prepended to them.
fr: Avec cette option, tous les fichiers source seront trouvés dans le répertoire indiqué. Cela revient à ce que tous les noms des fichiers source soient préfixés par S<« répertoire »>.

source: To make dh_install behave like the old dh_movefiles, move your package.files file to package.install and call dh_install with "--sourcedir=debian/tmp" appended to the command. This will approximate dh_movefiles behaviour, except it will copy files instead of moving them.
fr: Pour que dh_install se comporte comme l'ancien dh_movefiles, il suffit de renommer le fichier package.files en package.install et d'exécuter dh_install avec l'option S<« --sourcedir=debian/tmp »>. Cela produira un comportement proche de celui de dh_movefiles, sauf qu'il copiera les fichiers au lieu de les déplacer.

source: I<file [...] dest>
fr: I<fichier [...] destination>

source: Lists files (or directories) to install and where to install them to. The files will be installed into the first package dh_install acts on.
fr: Permet d'énumérer les fichiers (ou les répertoires) à installer ainsi que leur destination. Les fichiers indiqués seront installés dans le premier paquet traité par dh_install.

source: EXAMPLE
fr: EXEMPLE

source: Suppose your package's upstream Makefile installs a binary, a man page, and a library into appropriate subdirectories of debian/tmp. You want to put the library into package libfoo, and the rest into package foo. Your rules file will run "dh_install --sourcedir=debian/tmp". Make debian/foo.install contain:
fr: Par S<exemple :> le Makefile du paquet génère un fichier binaire, une page de manuel et une bibliothèque dans le répertoire adéquat de debian/tmp. L'objectif est de mettre la bibliothèque dans le paquet binaire libtoto et le reste dans le paquet binaire toto. Le fichier rules exécutera S<« dh_install --sourcedir=debian/tmp »>. Dans ce cas, il faut créer un fichier debian/toto.install qui S<contienne :>

source: While debian/libfoo.install contains:
fr: Tandis que debian/libtoto.install devra S<contenir :>

source: usr/lib/libfoo*.so.*
fr: usr/lib/libtoto*.so.*

source: If you want a libfoo-dev package too, debian/libfoo-dev.install might contain:
fr: S'il faut aussi créer le paquet libtoto-dev alors le fichier debian/libtoto-dev.install devra S<contenir :>

source: LIMITATIONS
fr: LIMITES

source: dh_install cannot rename files or directories, it can only install them with the names they already have into wherever you want in the package build tree.
fr: dh_install ne peut pas renommer les fichiers ou les répertoires, il peut seulement les implanter n'importe où dans l'arbre de construction du paquet mais avec le nom qu'ils possèdent déjà.

source: dh_installppp - install ppp ip-up and ip-down files
fr: dh_installppp - installe les fichiers ppp.ip-up et ppp.ip-down

source: B<dh_installppp> [S<I<debhelper options>>] [B<--name=>I<name>]
fr: B<dh_installppp> [S<I<options de debhelper>>] [B<--name=>I<nom>]

source: dh_installppp is a debhelper program that is responsible for installing ppp ip-up and ip-down scripts. into package build directories.
fr: dh_installppp est le programme de la suite debhelper chargé de l'installation des scripts ppp.ip-up et ppp.ip-down dans le répertoire de construction du paquet.

source: If a file named debian/package.ppp.ip-up exists, then it is installed into etc/ppp/ip-up.d/package in the package build directory. Files named debian/package.ppp.ip-down are installed to etc/ppp/ip-down.d/package
fr: S'il existe un fichier nommé debian/paquet.ppp.ip-up, il est installé, dans le répertoire de construction du paquet, sous etc/ppp/ip-up.d/paquet. Les fichiers nommés debian/paquet.ppp.ip-down sont, eux, installés sous etc/ppp/ip-down.d/paquet

source: Look for files named debian/package.name.ppp.ip-* and install them as etc/ppp/ip-*/name, instead of using the usual files and installing them as the package name.
fr: Recherche les fichiers nommés debian/paquet.nom.ppp.ip-* et les installe sous etc/ppp/ip-*/nom au lieu d'utiliser les fichiers habituels et de les installer sous le nom du paquet.

source: dh_installwm - register a window manager
fr: dh_installwm - inscrit un gestionnaire de fenêtre (window manager)

source: B<dh_installwm> [S<I<debhelper options>>] [B<-n>] [B<--priority=>I<n>] [S<I<wm ...>>]
fr: B<dh_installwm> [S<I<options de debhelper>>] [B<-n>] [B<--priority=>I<n>] [S<I<gestionnaire-de-fenêtre ...>>]

source: Any window manager programs specified as parameters will be registered in the first package dh_installwm is told to act on. By default, this is the first binary package in debian/control, but if you use -p, -i, or -a flags, it will be the first package specified by those flags.
fr: Tous les gestionnaires de fenêtre indiqués en paramètres seront inscrits dans le premier paquet traité par dh_installwm. Par défaut, il s'agit du premier paquet indiqué dans le fichier debian/control, mais, si les options -p, -i ou -a sont utilisées, il s'agira du premier paquet indiqué par ces options.

source: Files named debian/package.wm can list other window manager programs to register.
fr: Les fichiers debian/paquet.wm peuvent énumérer d'autres programmes gestionnaires de fenêtre à inscrire.

source: Set the priority of the window manager. Default is 20, which is too low for most window managers; see the Debian Policy document for instructions on calculating the correct value.
fr: Fixe la priorité du gestionnaire de fenêtre. La valeur par défaut est de 20 ce qui est trop peu pour la plupart des gestionnaires de fenêtre. Voir la Charte Debian sur la méthode de détermination de la valeur adéquate.

source: Do not modify postinst/postrm scripts. Turns this command into a no-op.
fr: Empêche la modification des scripts de maintenance postinst et preinst. Utiliser ce paramètre revient à ne rien faire.

source: I<wm ...>
fr: I<gestionnaire-de-fenêtre ...>

source: The commands used to run the window manager or window managers you want to register.
fr: Indique la commande utilisée pour lancer le gestionnaire de fenêtre ou le nom du gestionnaire de fenêtre à inscrire.

source: dh_installxfonts - register X fonts
fr: dh_installxfonts - inscrit les polices de caractères graphiques (X fonts)

source: B<dh_installxfonts> [S<I<debhelper options>>]
fr: B<dh_installxfonts> [S<I<options de debhelper>>]

source: dh_installxfonts is a debhelper program that is responsible for registering X fonts, so their corresponding fonts.dir, fonts.alias, and fonts.scale be rebuilt properly at install time.
fr: dh_installxfonts est le programme de la suite debhelper chargé de l'inscription des polices de caractères graphiques ainsi que de la reconstruction convenable des fichiers fonts.dir, fonts.alias et fonts.scale lors de l'installation.

source: Before calling this program, you should have installed any X fonts provided by your package into the appropriate location in the package build directory, and if you have fonts.alias or fonts.scale files, you should install them into the correct location under etc/X11/fonts in your package build directory.
fr: Avant d'exécuter ce programme, il est nécessaire d'avoir installé, dans l'emplacement adéquat du répertoire de construction du paquet, toutes les polices de caractères graphiques fournies par le paquet ainsi que les fichiers fonts.alias et fonts.scale dans etc/X11/fonts s'ils sont utilisés.

source: Your package should depend on xfonts-utils so that the update-fonts-* commands are available. (This program adds that dependency to ${misc:Depends}.)
fr: Le paquet doit dépendre de xfonts-utils afin que la commande update-fonts-* soit disponible. dh_installxfonts ajoute cette dépendance à ${misc:Depends}.

source: See L<update-fonts-alias(8)>, L<update-fonts-scale(8)>, and L<update-fonts-dir(8)> for more information about X font installation.
fr: Voir L<update-fonts-alias(8)>, L<update-fonts-scale(8)>, et L<update-fonts-dir(8)> pour obtenir plus d'informations sur l'installation des polices de caractères graphiques.

source: See Debian policy, section 11.8.5. for details about doing fonts the Debian way.
fr: Consulter la Charte Debian, section 11.8.5, pour les détails sur la gestion des polices de caractères sous Debian.

source: dh_link - create symlinks in package build directories
fr: dh_link - crée les liens symboliques dans le répertoire de construction du paquet

source: dh_link is a debhelper program that creates symlinks in package build directories.
fr: dh_link est le programme de la suite debhelper chargé de la création des liens symboliques dans le répertoire de construction du paquet.

source: dh_link accepts a list of pairs of source and destination files. The source files are the already existing files that will be symlinked from. The destination files are the symlinks that will be created. There B<must> be an equal number of source and destination files specified.
fr: dh_link utilise des listes de couples S<« source destination »>. Les sources sont les fichiers existants sur lesquels doivent pointer les liens symboliques, les destinations sont les noms des liens symboliques qui doivent être créés. Il B<doit> y avoir un nombre identique de sources et destinations.

source: The list can be specified in two ways. A file named debian/package.links can list pairs of files. If you use this file, you should put each pair of files on its own line, and separate the files within the pair with whitespace. Also, pairs of files can be specified as parameters - these pairs will only be created in the package build directory of the first package dh_link is told to act on. By default, this is the first binary package in debian/control, but if you use -p, -i, or -a flags, it will be the first package specified by those flags.
fr: La liste peut être indiquée de deux S<manières :> Un fichier nommé debian/paquet.links énumère les couples. Dans ce cas, il faut placer chaque couple sur une ligne différente et séparer la source de la destination par un blanc (whitespace). Les couples sont indiqués en paramètres de la ligne de commande. Les liens sont alors créés dans le premier paquet traité par dh_link. Par défaut, il s'agit du premier paquet indiqué dans le fichier debian/control, mais, si les options -p, -i ou -a sont utilisées, il s'agira du premier paquet indiqué par ces options.

source: Be sure you B<do> specify the full filename to both the source and destination files (unlike you would do if you were using something like L<ln(1)>).
fr: Il faut B<absolument> indiquer le nom complet des sources et des destinations, contrairement à l'usage habituel de commandes telles que L<ln(1)>.

source: dh_link will generate symlinks that comply with debian policy - absolute when policy says they should be absolute, and relative links with as short a path as possible. It will also create any subdirectories it needs to to put the symlinks in.
fr: dh_link produit des liens symboliques conformes à la Charte S<Debian :> absolus lorsque la Charte indique qu'ils doivent l'être et relatifs, avec un chemin aussi court que possible, dans les autres cas. dh_link crée également tous les sous-répertoires nécessaires à l'installation des liens symboliques.

source: dh_link also scans the package build tree for existing symlinks which do not conform to debian policy, and corrects them (v4 or later).
fr: De plus, dh_link scrute le répertoire de construction du paquet pour trouver (et corriger à partir de la v4 seulement) les liens symboliques non conformes à la Charte Debian.

source: Create any links specified by command line parameters in ALL packages acted on, not just the first.
fr: Crée les liens symboliques indiqués en paramètres dans TOUS les paquets et pas seulement dans le premier paquet construit.

source: Create a file named "destination" as a link to a file named "source". Do this in the package build directory of the first package acted on. (Or in all packages if -A is specified.)
fr: Crée un lien symbolique nommé S<« destination »> pointant vers un fichier nommé S<« source »>. Ce lien est créé dans le répertoire de construction du premier paquet traité (ou de tous les paquets si -A est indiqué).

source: dh_link usr/share/man/man1/foo.1 usr/share/man/man1/bar.1
fr: dh_link usr/share/man/man1/toto.1 usr/share/man/man1/titi.1

source: Make bar.1 be a symlink to foo.1
fr: Produira un lien titi.1 pointant vers toto.1

source: dh_link var/lib/foo usr/lib/foo \ usr/share/man/man1/foo.1 usr/share/man/man1/bar.1
fr: dh_link var/lib/toto usr/lib/toto \ usr/X11R6/man/man1/toto.1 usr/share/man/man1/titi.1

source: Make /usr/lib/foo/ be a link to /var/lib/foo/, and bar.1 be a symlink to the foo.1
fr: Crée un lien /usr/lib/toto qui pointe vers le fichier /var/lib/toto et un lien symbolique titi.1 qui pointe vers la page de man toto.1.

source: dh_listpackages - list binary packages debhelper will act on
fr: dh_listpackages - énumère les paquets binaires que debhelper va traiter

source: B<dh_listpackages> [S<I<debhelper options>>]
fr: B<dh_listpackages> [S<I<options de debhelper>>]

source: dh_listpackages is a debhelper program that outputs a list of all binary packages debhelper commands will act on. If you pass it some options, it will change the list to match the packages other debhelper commands would act on if passed the same options.
fr: dh_listpackages est le programme de la suite debhelper chargé de produire la liste de tous les paquets binaires que les commandes debhelper traiteront. Si ce programme reçoit des paramètres, il adapte cette liste afin de la rendre conforme à la liste des paquets qui seraient traités par les autres programmes debhelper s'ils recevaient ces mêmes paramètres.

source: dh_makeshlibs is a debhelper program that automatically scans for shared libraries, and generates a shlibs file for the libraries it finds.
fr: dh_makeshlibs est le programme de la suite debhelper qui automatise la recherche des bibliothèques partagées et produit un fichiers S<« shlibs »> pour celles qu'il a trouvées.

source: B<-m>I<major>, B<--major=>I<major>
fr: B<-m>I<numéro-majeur>, B<--major=>I<numéro-majeur>

source: Instead of trying to guess the major number of the library with objdump, use the major number specified after the -m parameter. This is much less useful than it used to be, back in the bad old days when this program looked at library filenames rather than using objdump.
fr: Permet de préciser le numéro majeur de version de la bibliothèque, au lieu d'essayer de le déterminer avec objdump. Ce paramètre est devenu beaucoup moins utile qu'autrefois où dh_makeshlibs se basait sur le nom du fichier de bibliothèque et non sur l'utilisation d'objdump.

source: B<-V>, B<-V>I<dependencies>
fr: B<-V>, B<-V>I<dépendances>

source: B<--version-info>, B<--version-info=>I<dependencies>
fr: B<--version-info>, B<--version-info=>I<dépendances>

source: By default, the shlibs file generated by this program does not make packages depend on any particular version of the package containing the shared library. It may be necessary for you to add some version dependancy information to the shlibs file. If -V is specified with no dependency information, the current upstream version of the package is plugged into a dependency that looks like "packagename (>= packageversion)". Note that in debhelper compatibility levels before v4, the debian part of the package version number is also included. If -V is specified with parameters, the parameters can be used to specify the exact dependency information needed (be sure to include the package name).
fr: Par défaut, le fichier shlibs produit par ce programme ne rend pas les paquets dépendants d'une version particulière du paquet contenant la bibliothèque partagée. Il peut être utile d'ajouter une indication de dépendance de version au fichier shlibs. Si -V est indiqué sans préciser de valeur, elle sera fixée comme étant égale à la version du paquet amont actuel, de la manière S<suivante :> S«<packagename (> =) packageversion »>. S<Nota :> Dans les niveaux de compatibilité inférieur à v4, la partie Debian du numéro de version du paquet est incluse également. Si -V est employé avec un paramètre, celui-ci peut être utilisé pour indiquer la dépendance requise exacte (inclure absolument le nom de paquet).

source: Beware of using -V without any parameters; this is a conservative setting that always ensures that other packages' shared library dependencies are at least as tight as they need to be (unless your library is prone to changing ABI without updating the upstream version number), so that if the maintainer screws up then they won't break. The flip side is that packages might end up with dependencies that are too tight and so find it harder to be upgraded.
fr: L'usage de -V sans paramètre est risqué. C'est une disposition conservatoire qui garantit que les dépendances des autres paquets envers la bibliothèque partagée sont aussi strictes qu'elles le doivent (à moins que la bibliothèque soit sujette à des changement d'ABI sans mise à jour des numéros de version amont). De cette manière, si le responsable du paquet cafouille, les autres paquets ne seront pas cassés. Le risque est que les paquets pourraient finir par avoir des dépendances tellement strictes qu'il serait difficile de les mettre à jour.

source: Exclude files that contain "item" anywhere in their filename or directory from being treated as shared libraries.
fr: Permet d'exclure du traitement des bibliothèques partagées les fichiers qui comportent S<« élément »> n'importe où dans leur nom.

source: Create an additional line for udebs in the shlibs file and use "udeb" as the package name for udebs to depend on instead of the regular library package.
fr: Ajoute une ligne supplémentaire, pour les udebs, dans le fichier shlibs et rend les udebs dépendants du paquet indiqué par S<« udeb »> au lieu qu'ils soient dépendants du paquet normal de la bibliothèque.

source: Assuming this is a package named libfoobar1, generates a shlibs file that looks something like: libfoobar 1 libfoobar1
fr: En admettant que le paquet s'appelle libtoto1, cette commande produit un fichier shlibs tel S<que :> libtoto 1 libtoto1

source: Assuming the current version of the package is 1.1-3, generates a shlibs file that looks something like: libfoobar 1 libfoobar1 (>= 1.1)
fr: En admettant que la version actuelle du paquet soit 1.1-3, cette commande produit un fichier shlibs tel S<que :> libtoto 1 libtoto1 (>= 1.1)

source: dh_makeshlibs -V 'libfoobar1 (>= 1.0)'
fr: dh_makeshlibs -V 'libtoto1 (>= 1.0)'

source: Generates a shlibs file that looks something like: libfoobar 1 libfoobar1 (>= 1.0)
fr: Produit un fichier shlibs tel S<que :> libtoto 1 libtoto1 (>= 1.0)

source: dh_md5sums - generate DEBIAN/md5sums file
fr: dh_md5sums - crée le fichier DEBIAN/md5sums

source: B<dh_md5sums> [S<I<debhelper options>>] [B<-x>] [B<-X>I<item>] [B<--include-conffiles>]
fr: B<dh_md5sums> [S<I<options de debhelper>>] [B<-x>] [B<-X>I<élément>] [B<--include-conffiles>]
